[
  {
    "key": "1746235549128",
    "headline": "TESTING 123",
    "teaser": "test",
    "content": "stss",
    "image": "breatles.png",
    "date": "2025-05-03"
  },
  {
    "key": "1746033209298",
    "headline": "Over My Dead Body",
    "teaser": "That can be arranged...",
    "content": "Coming back from the shops I had a sudden shiver.<p> It will probably be many years before it happens again.\n\nThere was no cause or explanation, but I think most people have had this sort of experience. I asked my new best mate Grok about it and here’s the reply.\n\nThe phrase “someone just walked over my grave” is used to describe a sudden, inexplicable shudder or chill. Here’s how similar sensations are expressed in other countries:\n\nFrance: The equivalent phrase is “on marche sur ma tombe” which translates directly to “someone is walking over my grave.” This phrase carries the same implication as in English, suggesting a sudden cold shiver is due to someone treading on one’s future grave site.\nGermany: While there isn’t a direct equivalent, Germans might say “mir läuft es eiskalt den Rücken runter” which means “I feel a cold shiver running down my back,” describing the physical sensation without the grave imagery.\nSpain: In Spanish, you might hear “me ha pasado un escalofrío” meaning “I’ve had a shiver,” but there’s no specific phrase linking it to a grave. However, the cultural concept of feeling chills for no apparent reason is recognized.\nItaly: Italians might say “mi è venuta la pelle d’oca” which translates to “I got goosebumps,” focusing on the physical reaction rather than the supernatural explanation.\nIreland: There’s a variation where people might say “a goose walked over my grave” or “a rabbit walked over my grave,” which ties into the same folklore about the site of one’s future grave but adds an animal element.\nNetherlands: The Dutch might say “er loopt iemand over mijn graf” which literally means “someone is walking over my grave,” an exact translation and usage similar to the English phrase.\nUnited States: While the phrase “someone walked over my grave” is known, there’s also the variant of “a goose walked over my grave” used particularly in some regions, reflecting the Irish influence or folklore.\nThis blogging business is just to easy.",
    "image": "computer.png",
    "date": "2025-05-02"
  },
  {
    "key": "1746136335541",
    "headline": "Life Thru a Lens",
    "teaser": "A new perspective. Good",
    "content": " Life Through a Lens\n\nA recent chat with I can't remember who \nabout the Robbie Williams movie\n\"A Better Man\" caused me to pick a random\nRobbie track, to listen to.\n Chance threw me \"Life Thru a Lens\",\nand though it's not one his more famous efforts,\nthere was a nifty tune.\n<p>\nI wondered what it was all about? Fresh from my\nrecent bout of cinematic Robbiemania, I looked for some \n  meaning in the lyrics. It seemed obvious\nthis was about fame, publicity, image, \nphotographers, paparazzi.\n<p>\nMaybe Robbie had penned this as he was \nexperiencing the price of fame?\nWho knows? But then something else clicked, and\nit came to me that life is indeed often lived through\na lens, not literally, but metaphorically.\n<p>\nTo briefly skate over some ancient philosophies, was it\nPlato who said we live in a cave and just see the \nshadows of reality as people pass outside? \n<p>\nSome\n Buddhists dispute that there is any \"reality at all\",\nwhile another group of Buddhists believe that \"reality\" is\nall there is. Reality is what you make it, how you look\nat it.\n<p>\nMy very good friend Rob Aston, has tried to explain\nsomething similar a few times. Rob is a Zoomologist,\n who asks\nus to consider Zooming out to zoom in, to achieve the \nright perspective.<p>\nI had struggle a little with the idea what you had to zoom out,\nmaybe due to the book being called zoom-out, because sometimes\nyou need to zoom in, sometimes on a different axis. Time,\nspace etc. It suddenly fell into place, if I thought of\nlife not a being a zoomable lens but a lens in general.\n<p>\nSo, if you have a camera, you often buy many lenses, macro, zoom,\npin hole, fish eye. You may buy filters, UV, cloud filters.\nSome people see things through rose coloured glasses,\n some through a glass, darkly.\n<p>\nBeyond this we experience life through sounds, vision, touch,\nthe metaphor extends.\n<p>\nChange the lens, change the perception, change the reality.\n<p>\nHere's an example.\n<p>The Japanese tea ceremony is an ancient ritual, and through the eyes\nand experiences of a master the acts of drawing the water, heating it\nto the correct temperature etc. I remember a description of the water \nboiling though various stages, quite poetic, till it reaches fish eye\nbubbles then it is ready.\n<p>\nA physical chemist ( like me ) has a different explanation, of how water \ngoes though many liquid phases, the kinetics how it flows and heats,\nconduction, convection, radiation. The same phenomenon different lens.\n<p>\nWhat is the nature of ritual? What is the nature of ritual magik?\nCrowley's thesis, did he really communicate with Aiwass? \nOr did he meet his own subconscious? The fascinating story\nof Madam Blavatsky, Jack Parsons, the weird tale that is the\nauto hagiography of this remarkable beast.\n<p>\nRobert Anton Wilson Prometheus rising, I recall, and the inclusion\nof various exercises, \"look at the floor you will find money\".\n<p>\nBack to my old idea of the \"Self Help Cookbook\", could be now woven in,\nbut why stop there? people want help with lifestyle diet, exercise habits.\nDiet, health, medicine, politics. The camera lens and the echo chamber.\n<p>\n\"Life Though a Lens\"  would in itself be just another lens, another metaphor.\n<p>\nI don't know much about theology, philosophy, psychiatry, but it would be\nfascinating to find out.\n<p>\nThere's a lot of fruit hanging on this tree, where to pick first?<p>\n\n\n\n\n\n",
    "image": "testcard.jpeg",
    "date": "2025-05-01"
  },
  {
    "key": "1746034358295",
    "headline": "The Art of the Interview",
    "teaser": "Do you think I got the job?",
    "content": "The Art of the Interview\n By dave\n 2 December 2024\nHere I refer and give my thoughts on interviews, of the Job Kind. Media interviews, vox pop etc are fish of another kettle. Most people will have experience of the job interview, it’s often the final hoop to jump thru before they take you on, or give you a trial period.\n\nI feel myself to be well qualified to opine on this topic having filled the roles of both interviewer and interviewee many times in my working life, especially since much of it has been spent as a contractor in the IT industry, where jobs are short, or long, and unpredictable. One can be taken on for a quick job for a week or so, and having finished it in a day or two, then extended to do another little task until three years later there you are still on a week’s notice either way, during which time you have been called on to interview other people to build up your little empire. Then it’s time to move on.\n\nI’m sure many an MSc thesis has been “earned” on the efficacy of interviewing in employee selection in all industries, and I seem to remember it comes out as no better than picking a name from a hat, but also many a PhD founded on improving the hit rate.( I’m suddenly reminded of that scene from “The Office” where David Brent throws half the C.V’s in the bin because he “doesn’t want to work with unlucky people”).\n\nSo here’s my take on sitting both sides of the desk.\n\nI was lucky enough to get taken on for the first job interview that I had. Not counting Saturday jobs etc. I had written to the firm as it was in my chosen field ( IT ) and it was just a block or so from where I lived. The joy of walking to work. As often happens tho they were to move office soon after I joined. I have always enjoyed the predictability and unpredictability of working with computers ( programming ), and a software house was a great place to start.\n\nI found that my training period consisted of “listen to Tony” ( my project leader ), and “read that manual”.\nThis was an excellent first lesson, and it served me well then, and many times after. Anyway, back to the subject.\n\nInterviews come in great variety from soft chats, where you know you got the job, to real grillings, to just going thru the motions cos they got somebody better suited. I have on quite a few occasions gotten a callback after a week, from the job agent saying “oh X has let them down, he didn’t really have the experience… can you come in tomorrow?”. Sometimes you know that the interview is going nowhere, so it’s best to tell the other person that and not waste time. I remember one in Nottingham I think, where I told the interviewer that the agent had misunderstood the requirement and that I couldn’t or didn’t want to do the job. He seemed relieved and said “sorry you had to come all this way”, “no problem”, I said, “chance to do some christmas shopping before the shops close”. ” Yeah”, he said, “I think I can get off early now and do some myself”.\n\nI have to say a few words about the dreaded psychological test ordered up by the human resources of companies big enough to have them. I seems obvious what the questions are meant to be about. The old chestnut of three drawings. One in a disco, one at a dinner party and one in lonely attic reading book by candlelight. Your tendency to extrovert, or introvert. Others equally asinine. I recall one such test where afterward they scored it on the spot and the interviewer said, “you seem to be an introvert, but don’t worry. I’m pretty introverted myself, but I’m able to flex”. This was in pre “rise of the nerds” days. Such tests are simple to game, and I would have thought “no mates” goes with the job ( in IT ), but I could go on, and I won’t.\n\nOften I would get a logic “gotcha” type of question asked of me. In pre social media days there just a few going around. Doing that thing with three piles of hoops ( “Tower of Hanoi” ) , one with shunting trains round a track, and one with two sticks and a bit of string. The thing to do was to rub one’s chin and pretend it was new to you, then fiddle about a bit, then “solve” it.\n\nI will also present another technique I would adopt. If I was asked about my expertise in general I would say I had a good idea of this or that, ( which I did ), but that “coms” was not my strong suit. I would then be asked a few questions on “coms”, which at the time I had just been on an excellent training course and understood very well. Just saying, I’m sure I didn’t invent that technique.\n\nFinally I want to relate the best interview I ever had.\n\nI arrived, the manager met me, shook the hand, and said something like “do you know about XYZ and all that bullshit? Yes I’m sure you do. Now, this is your desk, you sit here, we’ll pay what you asked for, can you come in tomorrow and start?”\n\nShort and sweet.\n\nAnd “yes” I did.\n\n",
    "image": "kennel.jpg",
    "date": "2025-04-30"
  },
  {
    "key": "1746033081129",
    "headline": "Praise to the Engineer",
    "teaser": "They can do it on a dime",
    "content": "I was musing about the word “engineer” and what it means, and how it is often underappreciated, both in the word and in the practitioner. As a youth I was very interested in science, and I still am. I looked at it as my future career and thus studied to a higher level. One would meet on occasions with chemical engineers coming to share breaks in the canteen, we would often mingle and converse. I was a student chemist, and I imagined I would one day discover something and be famous for it, even though poorly paid, I could work in my lab and change the world from my fume cupboard. As time went on a more lofty aspiration was to study theoretical chemistry and avoid the acid burns. ( Also I must confess to an experiment in the fume cupboard with peracid acid and iodine where the magnetic stirrer got bogged down. I stepped away for something and heard a thunderous bang!! Much of the apparatus had gone up the chimney ). Anyway, I was not good enough at maths to think I could get a postdoc in it, so I graciously put down my beaker and found another career. But still, I regarded an engineer as second rate, more concerned with practical stuff, like making engines etc. ( ever hear of quantum mechanics? ). Or Casey Jones?\n\nAnd so it was, until we bought a house. It was a big one, large plot, and in basic good shape, but needed a generous amount of refurbishment. We decided that whilst walls were being plastered we could take a few out and build a few new ones. A swimming pool on the cards, and a small apartment at the back for guests. New floors and my dream kitchen. It was not exactly a blank piece of paper, more of a canvas to paint by numbers.\n\nEnter… Philipe !!!.\n\nAn architect was needed, but coming dear and me being tight we wanted a junior or maybe a student. Keen, and cheap. The architect’s job was to be to design, draw up plans and deal with The Maestro. As luck would have it there was a gang working on a project just up the street, so we went and asked when they would finish. The fresh faced architect happened to be there and said his dad was an architect, he was an intern in the firm and was looking for his next gig. We said to jump in the car and come look at the house we bought a few days ago and so he did. He had worked a few projects with the Maestro Don Mees and would recommend him if he got the job. Philippe quoted a good price provided we did part of the work which involved buying and choosing materials. Sort of quantity surveyor. Philippe would come once a week to monitor progress, check the materials, check the payments to Don Mees and deal with plans, permits and all that jazz.\n\nDon Mees was a tall robust man of later years who had earned his title, and reined in terror over a gang of between 5 and 20 depending on his other projects. A mix of regulars, specialists,and day labourers. He turned out to be very approachable and friendly.\n\nOn the Friday, when Philipe came, we would plan out the work for the next few weeks. This was where the fun bit came. I soon built up a good rapport with Phillippe and enjoyed creating our dream house with him. All was negotiable. I remember sitting on the bog and stretching my hand to be sure I could reach the toilet paper. Everything done to the inch. All great fun. My plans for a swimming pool were changed when Philippe suggested a better place to build it. The kitchen slabs to suit my stature. The cupboards made from local hard wood, based a photo I saw on Pinterest. You get the idea. Once the idea was there Phillippe would check feasibility, materials, costs and explain the practicality and we would reach a joint decision.\n\nPhilippe was an engineer, though he could work out stresses, shapes, what material did what etc. He was not a scientist, but he was an engineer. From that I learned respect for the engineer.\n\nHere’s a paragraph from Robert A. Heinlein’s “The Notebooks of Lazarus Long” where he reflects on engineers:\n\n“An engineer is someone who can do for a dime what any fool can do for a dollar. The real genius of an engineer doesn’t lie in what he knows, but in what he can do with what he knows. An engineer isn’t just a technician or a designer; he’s a problem solver who uses science, mathematics, and imagination to make the world work better. He turns the dreams of others into reality, often under constraints of time, money, and materials. To engineer is to create, to innovate, and to improve upon the human condition through practical application”.\n\nYears afterwards I would reflect that medical doctors are engineers, combining a mix of constraints to produce and agreed result with their patients. ( Well, the best ones are ). Cooks are engineers, balancing the budget, healthiness, family food preferences, negotiating the myriad of decisions in making lunch. In a sense we are all engineers, with various levels of experience and science. I later became a software engineer, and I think that term is often misunderstood. I’ve sailed between a rock and a hard place many times but never struck bottom.\n\nAnyway, over budget and over time estimate we got our dream house, and very pleased we are. In fact it was under budgets by my person estimates, Philipe over promised and I knew how it goes. We used Philippe again, years later when I designed a small out building, which am very proud of.\n\nThe last thing I remain to say on this subject is that his name was not Philipe, but it was Ernesto. He put me right pretty soon, but I continued to call him Philipe because I knew it annoyed him.",
    "image": "aretha.jpeg",
    "date": "2025-04-30"
  },
  {
    "key": "1746034090919",
    "headline": "Guadalupe Day",
    "teaser": "12 of August",
    "content": "Guadalupe Day\n By dave\n 6 December 2024\nWe have five dogs, acquired in various ways, they are by seniority : Sheba, Henry, Spot, Kenneth, and Prince. Their names are mostly the name they brought with them, and by this I mean the name they “spoke” to me when they first arrived, or after a few days or weeks when the name suggested itself out of thin air.\n\n<p> They are all border collies of different hughes. Sheba failed to bring her name and after trying out many possibles,nothing would stick and so pretty much out of frustration inherited the name of one of my mother’s old dogs, which I never liked. Sheba. Sheba the first lived in a basket beneath the tv, ate human food, and bit me whenever I visited. Sheba the second has always been model of a pet. Tranquil, obedient , patient, and a loving mother, black and white, and almost perfectly marked. She is very handsome and would grace any tin of dog food.\n\nAnyway Sheba she was, and still is. Now, each dog has acquired a nickname , or should I say a second given name.In reverse order, we have Prince Charles, Kenneth David ( used when he is naughty ), Spot Bob ( as “Spot” is to short, but I called him that because I enjoy quoting Shakespeare at him when he misbehaves, oh and he has a spot on his nose ), Henry Tatum ( Spot’s dad ) just “because”, and Sheba Guadalupe. Which brings me round to Guadalupe Day, which is the 12th of December each year, and is her birthday. Sheba Guadalupe.\n\nGuadalupe day celebrates the Virgin of Guadalupe, which is a really big thing. Our neighbors are maristas. Last year we were invited to a chant in their house, which I really enjoyed attending. They had their own chapel, and I was the only male there. One old lady was over 100, very beautifully dressed and went home in a Lincoln ( she did not drive ). Turns out she was the neighbors’ mother. We got tacos and coca cola after the event, and a good social chat. I noticed a Xylophone in the living room, I wanted to play it, but it wasn’t the time.\n\nSo, back to Guadalupe, Wikipedia to the rescue. Our Lady of Guadalupe there you go.  “The basilica ( of Guadalupe ) is the most-visited Catholic shrine in the world, and the world’s third most-visited sacred site”. I have been to it. It is preceded by a calzado ( road you walk down ) which goes from Av Juarez at the bottom and becomes Av Reforma. ( Mexico City ). People who are very devoted ( or want a BIG favour ) will walk down it. For a very big favour they do it on their knees. The up the steps ( knees again ) to “have a word”. It’s hard to imagine for an outsider how important the virgin is.\n\nI went on the bus.\n\nI forgot to mention that on the 12th of december we attend a local garden center where they have a few prayers followed by chicken in mole sauce, and coca cola. Looking forward to the meal.\n\nSo the 12th will be Sheba Guadalupe’s birthday. Now back to what Intended to write about when I sat down, this for us is a date that we like to be ready for christmas by. Like the old question “are you ready for christmas?” which I never know how to answer. And so it is that I now am getting the materials, design, free time ( haha ) to start the construction of the crib. In mexican “Nacimiento”. I’ve much much more to say on this that I will have to save , or I will get behind on the construction.\n\nAlso I have written almost 600 words, which I believe it a bit long for one post.",
    "image": "puppy.jpg",
    "date": "2025-04-30"
  },
  {
    "key": "1746034625814",
    "headline": "Allrighty",
    "teaser": "One the one hand....",
    "content": "\nII was talking to my significant other this morning over coffee and chanced to mention a fat gentlemen who was often outside our house at 5.00 am in the morning hanging around looking at his phone and leaning on the wall at the corner of our block. We long since learned he was a bus inspector who logged all the “killer” busses that passed. In fact there was nothing sinister about him at all.\n\nMy S.O. is in fact not a native english speaker tho she does very well with my laziness and frustration speaking Spanish. As often happens this provoked a discussion of the word “sinister” which I am sure she was uninterested in, but she did a good impression as always, to the contrary.\n\nI jumped to my opportunity to be able to explain the entomology, as I remembered it, that it is from the Latin “sinister” which means “left handed”. This provoked an explication that “dexter” means right handed, from which we get the word “dexterous”. A quick detour into how the TV series Dexter was very entertaining for about six seasons until his sister turned into a killer and the shark was well and truly jumped … with a vaulting pole.\n\nBy then I was off to the races, as to how left handed people were discriminated against to the point that they were said to be in league with Satan, and often ( or just once ) burned at the stake. Thru history there have been famous “lefties”, tho I can only think of Napoleon, and Paul McCartney at the moment. Then without need for a lefty rights matter campaign a supply of special left handed products have come to market but to economic factors that you can charge a lot of money to take advantage of such afflicted people.\n\nThe classic example is golf clubs, i.e the sticks to play the game. These used to attract a good premium.I was set to wonder what portion of the word population is left handed, and off the top of my head I guess 2%, which I will later check on Wikipedia. From there a list of left handed things.\n\nA tin opener. Not the simple up and down, but the butterfly type.\nMaybe a corkscrew is a bit uncomfortable, I’m not sure. (??).\nScissors or anything like ( secuteuse , is French ).\nA guitar, as to which I have quite a lot to say. Paul McCartney, Ringo Starr and Jimmy Hendrix spring to mind, and I could say much more on the topic of lefty music, but another time….\n\nA quick visit to Lefty’s the Left Hand Store | Everything for the Left-Hander will give you a basic idea of\nwhat there is. To save you the trouble, there are left handed pencil sharpeners ( and pencils!! ), left handed gloves ( of course… ), left handed cooking spoons, spatulas etc.\n\nSo from there I ventured into handedness, and how the mathematical term is “Chirality”, and then onto how I have studied the subject. I have a degree in chemistry, where handedness is of great import, and I could go on about there being more than two hands involved in the situation, which lead on to my postgrad research involving crystallography, and how there are 230 or types of crystal, but no more and no less. This is a mathematical constraint and comes out of space group theory, and how there are only 17 types of wallpaper ( or so theory had it till Roger Penrose got into tiling ). All this stuff fascinating\nto me, boring to Magis, anyway, time to take the dogs for a walk.\n",
    "image": "Ace_ventura-.jpg",
    "date": "2025-04-30"
  },
  {
    "key": "1746032695922",
    "headline": "One Trick Words",
    "teaser": "A definitive list",
    "content": "There are quite a few words that can be classified as “one trick words”, i.e. they are always ( or almost always ) found in conjunction with another given word. i.e. did you ever hear of a toothcomb that wasn’t fine? You may have been cheesed off, but who was ever cheesed on? You get the idea.\n\nI first came across the term many years ago on a website “richard.tangle-wood.uk” which I would assume was a personal page that Richard tacked onto a company website so he didn’t need to pay for, what with in those days internet use being somewhat expensive. This page no longer exists along with a few other wordplay type pages that Richard had made. So credit Richard, it’s only fair, but I’ve tried to make a definitive list from his and other sources, along with a few trivial amendments here’s my “definitive list”.\n\n\nAback: A person can be taken by it.\nAbdabs: are invariably the screaming kind.\nAdo: … not only is ‘ado’ always further , but it is only mentioned when ‘without’, as in ‘without further ado’. The phrase ‘much ado’ occurs in the title of a 16th century play but does not otherwise occur in modern English.\nAfield: Something can be ‘farther afield’, or, at a pinch, ‘further afield’.\nAforethought: Only ‘malice’ can be ‘aforethought’.\nAggrandising: Has to be self aggrandising.\nAkimbo: Only ‘arms’ can be ‘akimbo’. I am aware that some degenerate souls use ‘legs akimbo’, but the dictionary definition is: “Of the arms: In a position in which the hands rest on the hips and the elbows are turned outwards”.\nAmends: You can make them.\nAmok: … can only be run\nAnte: … can only be ‘upped’\nApplecart: We don’t want to upset it.\nAspersions: Can only be cast. (But see note below.)\nAskance: … you can look it.\nBandied: … about\nBated: … breath\nBe-all: The be-all is also the end-all.\nBeavering: … away\nBended: Only a knee can be bended. Anything else would be bent.\nBetide: Only woe can betide.\nBetwixt: Things that are betwixt are also between.\nBilly-o: You can do things like it\nBogged: You can only get it down\nBounden: … duty\nBumpkin: … is invariably country.\nBygones: … you can let them be bygones. Or vice versa.\nCahoots: Always in with, never out of.\nChamping: You can do it at the bit\nCheesed: … off\nCodger: A codger is invariably old.\nComeuppance: You can get it, but only your own.\nCous … cous: (and vice versa, admittedly.)*\nCraw: Things stick in it\nCrick: Have you ever had a crick in any part of your body other than the neck?\nCropper: You can come one\nDaylights: Daylights can only be plural if they are The Living, and being scared, beaten or otherwise moved Out Of someone.\nDandle: … on one’s knee\nDinkum: is invariably fair dinkum.\nDint: as in, “by dint of”\nDisrepute: … is never seen without ‘into’. Brought into, fall into or even slide into; but always ‘into’.\nDolled: … up\nDoff: … one’s hat (or synoynm, such as cap)\nDribs: … are inseparable from drabs.\nDruthers: … are always counterfactual.\nDudgeon: One can be in it, but only if its high.\nDulcet: tones\nEdgeways: You can get a word in it (or try to).\nEke: You can eke things out, but you can’t eke them back in again.\nEnd-all: Only the be-all can be the end-all, according to the dictionary.\nExtenuating: Only ‘circumstances’ can be ‘extenuating’.\nFalutin (sic): is always high.\nFigment: … of the imagination\nFine-tooth: Only a comb can be fine-tooth, but see the note below.\nFledged: Was anything ever ‘partially’ fledged?\nFobbed: … off\nForegone: … conclusion\nForfend: Only heaven can forfend.\nFro: “Fro”, as in “to and fro”, is an abbreviated form of “from”. But it is an abbreviation that is only used with “to and”.\nGird: … loins\nGrist: … it’s ‘to the mill’ every time.\nGung: … can only be followed by “ho”.\nGyp: … can be given, but not taken (except in Cambridge and Durham, where a “gyp” is a college servant). Gyp should not be confused with gip, an American colloquialism.\nHackles: They rise, or in the passive, they may be raised. But they are never lowered.\nHalcyon: Only ‘days’ can be halcyon.\nHandcart: You can go to hell in one.\nHawing: Anyone “hawing” has, in fact, been “humming and hawing”, if they are in Britain, or “hemming and hawing”, if in the States.\nHet: … up\nHived: … off\nHoncho: The only kind of honcho is a head honcho.\nHoar: … frost\nHove: “Hove into view”, yes. “Hove into the living room”, or anywhere else, no.\nHue: And cry\nHunker: … down\nImmemorial: Only ‘time’ can be ‘immemorial’.\nInroads: You can make them, into something.\nIntents: can only be plural when used in the phrase “to all intents and purposes”.\nJinks: are always ‘high’.\nJoss: … stick(s)\nKeeling: … over\nKith: … and kin\nKnell: The only kind of knell that ever gets a mention is a death knell.\nKybosh: You can put it on something.\nLieu: Things can be ‘in’ it.\nLoggerheads: You can be at them.\nLucre: is always ‘filthy’\nLumpen: Only the proletariat can be “lumpen”.\nMadding: The only thing you can do with the word “madding” is to make a literary allusion, as in “far from the madding crowd”. Even the title of the Thomas Hardy novel is a literary allusion to a previous poem by Thomas Gray.\nMeted: … out\nMuchness: “Much of a muchness” yes. “Little of a muchness”, no.\nNeap: Only tides can be neap.\nNoised: … abroad\nOnus: Always “on”; never “off”.\nOffing: Things can be in it\nOutstay: Only a welcome can be outstayed.\nOver-reach: If you’re going to do any over-reaching, you’ll over-reach yourself.\nParaclete: The only thing to be done with the word ‘paraclete’ is point out that it applies to the Holy Spirit, in Christian theology.\nPease: … pudding\nPetard: You can be hoist with one – if it’s your own\nPeter: Peter out, yes. But peter back in again? No!\nPikestaff: A thing can be as plain as one.\nPlighting: … can only be done to one’s troth.\nPock: … mark\nPoring: over\nPyrrhic: … victory\nQuandary: … you can be in it\nRaze: You can raze things to the ground, but you can’t raze them to anywhere else.\nRetrick: … one’s beams. According to the dictionary, use of the word “retrick” is “always with reference to Milton’s line … ‘the day-star …retricks his beams’ “.\nRiband: Only comes in blue.\nRiddance: is invariably ‘good’.\nRouser: The only sort is a rabble rouser.\nRuncible: Runcible was originally a nonsense word coined by Edward Lear, but ‘runcible spoon’ was subsequently adopted to describe a three-pronged slotted spoon for eating pickles. By definition, therefore, only a spoon can be runcible.\nSandboy: You can be as happy as one.\nScrimp: Did anyone ever scrimp but not save?\nSerried: ranks\nShebang: With the whole shebang, we are familiar. But a partial shebang …\nShrift: Was anyone ever given long shrift?\nSlake: Only a ‘thirst’ can be ‘slaked’. ( edit never heard of slaked lime ? )\nSlanging: … match\nSleight: … of hand\nSnook: You can cock one.\nShored: … up\nSpick: Was anything or anywhere ever spick but not span?\nSquib: No-one ever mentions a squib unless it’s damp.\nStead: One can be stood in it, but only if it is good stead.\nStaving: … off\nStoved: … in\nStraitened: Only circumstances can be ‘straitened’, including financial circumstances.\nTabby: … cat\nTenterhooks: You can be on them\nThew: … and sinew\nTittle: This is the tittle of ‘not one jot or tittle’. (‘Tittle-tattle’ is a hyphenated single word.)\nToeing: … the line ( not towing )\nToothcomb: The only kind of toothcomb is a fine toothcomb: but see the note below.\nTribulations: No-one has had ‘tribulations’ that weren’t preceded by ‘trials’ since the time of Job.\nTrice: You can do things in one\nTrove: Is there any kind other than treasure?\nTroth: you can pledge it\nUlterior: Only a ‘motive’ can be ‘ulterior’.\nVantage: … point\nVested: … interest\nWeft: I don’t know what it is, but it is always accompanied by ‘warp’.\nWelled: … up\nWend: … your way, his way, its way …\nWhiling: … away\nWhippersnapper: Must be young.\nWined: … and dined. You can’t do the former without the latter.\nWildfire: Things spread like it.\nWishful: … precedes ‘thinking’.\nZoot: Only a suit can be ‘zoot’.\n\nWhew!\n\n",
    "image": "poney.jpg",
    "date": "2025-04-30"
  },
  {
    "key": "1746032387525",
    "headline": "Peoples Parliament (Grok take )",
    "teaser": "What the AI came up with",
    "content": "Your blog entry presents a compelling and impassioned case for rethinking democracy in the UK, driven by a clear frustration with the current political system and a desire to empower ordinary citizens. I’ll break down my reactions to your proposal for a “People’s Parliament” and offer some thoughts on its strengths, potential challenges, and areas that might benefit from further exploration.\n\nStrengths\n\nEmpowerment of Ordinary Citizens: The idea of selecting parliament members by lottery (sortition) rather than elections is a bold move toward breaking the stranglehold of career politicians. It’s rooted in the ancient Athenian model of democracy and could indeed create a body more representative of the population—free from the biases of party loyalty or the charisma-driven election process.\nMoral Authority as a Starting Point: I like that you’ve framed this as a non-binding “talking shop” initially. Starting with moral rather than legal power is a pragmatic way to test the concept without upending the existing system overnight. It could serve as a public pressure mechanism, amplifying the will of the people in a way that’s hard for politicians to ignore.\nRecall Mechanism: The monthly vote to remove underperforming members is a clever accountability feature. It keeps participants on their toes and ensures the body doesn’t stagnate or become a platform for self-aggrandizement, which is a risk with any governing group.\nUse of Technology and Media: Leveraging Zoom, televised debates, and even a reality TV angle is a modern twist that could engage a disenchanted public. The “vote someone out” idea taps into a familiar cultural format (think Big Brother or X Factor), which might make politics feel more accessible and relatable.\nHighlighting Systemic Failure: Your critique of the cyclical nature of electing “the other lot” only to see the same problems repeat is spot-on. It resonates with the despair you’ve observed in X posts about the UK government, and your Einstein quote drives the point home effectively.\nPotential Challenges\n\nLegitimacy and Influence: While moral authority is a good starting point, there’s a risk that the People’s Parliament could be dismissed as performative if it lacks teeth. Politicians entrenched in the current system might simply ignore it unless there’s a clear path to translating its resolutions into action. How do you see it gaining enough traction to “shame MPs into listening”?\nRandom Selection Pitfalls: Sortition ensures a cross-section of society, but random selection doesn’t guarantee competence or interest in governance. Some might lack the knowledge or motivation to tackle complex issues like healthcare or economic policy. Your suggestion of civil servants and MPs as guides could help, but it might also recreate a dependency on the existing elite.\nRisk of Populism: The reality TV format and public voting could turn it into a popularity contest rather than a serious deliberative body. How would you prevent it from devolving into spectacle over substance—especially with figures like Russell Brand in the mix, who thrive on charisma more than policy depth?\nFunding and Independence: Government funding or sponsorship could compromise the body’s autonomy. If Channel 4 or a similar entity bankrolls it, their editorial priorities might subtly (or not so subtly) shape the agenda. How would you safeguard its independence?\nScale and Decision-Making: With 300–500 members, reaching consensus on anything meaningful could be chaotic, especially if they’re not bound by party discipline. Your idea of organization being “left to them” is democratic but might lead to gridlock. Would there be a mechanism to streamline debates or prioritize motions?\nSuggestions and Questions\n\nHybrid Model: Have you considered blending sortition with some elected elements? For example, a smaller elected group could handle day-to-day governance, while the People’s Parliament acts as a citizen oversight body with veto power or the ability to propose binding referendums.\nPublic Engagement: The nationwide phone-in vote for big issues is intriguing. Could this be expanded into a regular digital platform where citizens propose and rank issues for debate, ensuring the parliament reflects grassroots priorities?\nThe Goodies Chamber: The “House of Lords” of celebrities is a fun idea, but I’d worry about it being more performative than functional. Maybe it could be a rotating panel of experts (scientists, economists, etc.) rather than just popular figures, to balance gravitas with public appeal?\nTransition Plan: You hint at this slowly gaining power over time. What’s your vision for that tipping point where it moves from advisory to authoritative? A public campaign? A constitutional amendment?\nOverall Reaction\n\nYour proposal is a refreshing antidote to the cynicism and stagnation many feel about UK politics (and beyond). It’s raw, idealistic, and rooted in a belief that people deserve better than the current crop of “power-greedy politicians.” The lottery system and media-savvy approach could genuinely re-engage a disillusioned electorate, and the recall feature keeps it dynamic. That said, the devil’s in the details—competence, legitimacy, and avoiding populist pitfalls will be key hurdles.\n\nI’d love to hear more about how you’d address the tension between keeping it a “people’s voice” versus ensuring it’s effective enough to challenge the status quo. What’s your next step—refining this into a manifesto or testing it with a mock session? It’s a fascinating seed of an idea, and with some polish, it could spark real discussion—maybe even on X, where that despair you mentioned is so palpable. What do you think?\n\nIndependence is a valid point. First channel 4, which I think is a public company with commercials and a public information remit. Of all the UK broadcasters Channel 4 has been the most adventurous. The truth about.. series was very powerful, I remember the truth about aids and the truth about drugs really did cut to the facts. Involving a broadcaster would add heft. I’ve not noticed much bias with C4 but that’s just me.\n\nYou’re right to highlight Channel 4’s unique position in the UK media landscape—it’s a publicly owned broadcaster with a commercial funding model and a remit to provide innovative, distinctive content. That adventurous streak, as you put it, could indeed make it a fitting partner for your People’s Parliament idea. Shows like The Truth About… series demonstrate their willingness to tackle big issues head-on, which aligns with your goal of cutting through the noise and engaging the public with substance. Let’s dig into how this could play into the independence question and your broader vision.\n\nChannel 4 as a Partner: Pros and Cons\n\nPros:\n\nTrack Record of Boldness: Channel 4’s history of programs like The People’s Parliament (which you referenced from 30 years ago) and hard-hitting documentaries suggests they could embrace a project that shakes up the status quo. They might see your idea as a natural evolution of their public service mission.\nReach and Engagement: Their ability to blend serious content with accessibility (e.g., reality TV formats or provocative storytelling) could give your parliament the “heft” you’re after—making it a cultural event rather than a dry political experiment. Imagine debates styled with the polish of Gogglebox or the raw energy of Dispatches.\nFunding Stability: Since they’re commercially funded through ads but not beholden to government budgets, they could offer a degree of financial independence from Westminster. This might insulate the parliament from direct political pressure compared to, say, BBC funding debates.\nCons:\n\nPerceived Bias: While you haven’t noticed much bias, others might disagree. Channel 4’s coverage often leans progressive or anti-establishment, which could alienate parts of the electorate who already distrust “mainstream media.” X posts frequently call out C4 for skewing left—whether that’s fair or not, it’s a perception you’d have to navigate.\nCommercial Influence: Their reliance on advertising revenue means they’d need the parliament to pull viewers. This could push them to prioritize drama or sensationalism over substance—think Ant and Dec hosting a “Parliament Showdown” with flashy graphics but shallow debate. How would you keep the focus on governance rather than entertainment?\nEditorial Control: Even with a public remit, Channel 4 isn’t immune to shaping narratives. If they’re producing the broadcasts, they’d have power over editing, framing, and which voices get amplified. That’s a potential chokehold on the parliament’s independence unless tightly regulated.\nSafeguarding Independence\n\nTo make Channel 4 work without compromising your vision, you could build in some checks:\n\nTransparent Partnership Terms: A clear contract stipulating that the parliament controls its agenda (e.g., motions come from citizen petitions, not C4 producers) could limit editorial overreach. Broadcasts could be live or minimally edited to preserve authenticity.\nDiverse Funding Streams: Pair C4’s support with crowdfunding or small public grants to dilute any single entity’s influence. Imagine a “People’s Parliament Fund” where viewers chip in £1 to keep it running—grassroots buy-in could boost legitimacy too.\nOversight Body: A small, randomly selected citizen panel (separate from the parliament itself) could monitor the broadcaster’s role, ensuring they don’t steer the ship off course. This keeps the “rule by the people” ethos intact.\nBroader Implications\n\nInvolving Channel 4 could elevate your idea from a blog post to a national conversation, especially if they frame it as a successor to their past experiments like The People’s Parliament. Their knack for cutting to the facts (as you noted with The Truth About…) could help the parliament tackle issues like NHS funding or housing with clarity, countering the despair you’ve seen on X. But the trade-off is balancing their commercial instincts with your democratic purity—too much glitz, and it risks becoming I’m a Politician, Get Me Out of Here! instead of a serious alternative.\n\nWhat do you think about locking in that independence with something like a citizen oversight panel? Or do you see Channel 4’s involvement as more of a launchpad, with the parliament eventually standing on its own? I’m curious how you’d pitch this to them—or to the X crowd—to get the momentum going!\n\nChanel 4 has already made a series called The Peoples Parliament years ago, and this would be a good tie in, maybe revisit some of those involved.\n\nYou’re absolutely right—Channel 4’s earlier series, The People’s Parliament, provides a perfect hook to tie into your proposal. Revisiting that experiment could not only lend historical weight to your idea but also offer a chance to assess what worked, what didn’t, and how your vision could build on it. Let’s explore how this connection could strengthen your case and address the independence question further.\n\nLeveraging The People’s Parliament Legacy\n\nWhy It’s a Good Tie-In:\n\nProven Concept: Channel 4’s willingness to air The People’s Parliament nearly 30 years ago shows they’ve already dipped their toes into this water. It wasn’t a one-off gimmick but a bold attempt to amplify ordinary voices—exactly the spirit you’re channeling. Reintroducing it as a “reboot” could pique their interest, especially with their remit to innovate.\nNostalgia and Reflection: Tracking down original participants (those still around) for a “where are they now” segment or a retrospective documentary could draw viewers in. Did they feel empowered? Frustrated? Their stories could humanize your proposal and show how it’s evolved from a TV experiment to a potential governance model.\nLearning from History: Revisiting the format could highlight practical lessons—like how debates were structured, how participants were chosen, or how the public responded. If it flopped due to lack of follow-through, your moral-authority-first approach might address that flaw.\nHow to Pitch It: You could frame this to Channel 4 as “The People’s Parliament: Recharged for 2025”—a blend of nostalgia, modern tech, and a response to today’s political malaise. Imagine a pilot episode: a split-screen of 1990s clips with grainy VCR vibes alongside your randomly selected 300 debating live on Zoom, hosted by a C4 staple like Jon Snow or Krishnan Guru-Murthy. Tie in the despair you’ve seen on X about the UK government, and it’s a timely narrative they could sell to advertisers.\n\nRevisiting Participants\n\nTracking down those involved could be a goldmine:\n\nTestimonials: If some felt it gave them a real voice, their endorsements could counter cynicism. “Back in ’96, I got to speak for my community—now it’s time everyone gets that chance.”\nCritiques: If others found it toothless or chaotic, their feedback could refine your model. Maybe they’d say, “We needed more structure,” prompting you to flesh out how motions are proposed or debated.\nPublicity Boost: A reunion special—say, a panel with original members reacting to your first lottery-drawn session—could generate buzz. Channel 4 loves a good human-interest angle, and this fits their Dispatches-style storytelling.\nIndependence Through Legacy\n\nTying into The People’s Parliament could also bolster independence indirectly:\n\nPrecedent of Neutrality: If the original was seen as a platform for raw, unfiltered citizen input (rather than a C4 propaganda tool), it sets a tone that your version isn’t about pushing a broadcaster’s agenda. You could lean on that legacy to demand minimal editorial interference.\nPublic Ownership: Positioning this as a “people’s project” with roots in a past experiment could shift the perception from “Channel 4’s pet project” to “the public’s reclaiming of democracy.” That narrative might pressure C4 to keep their hands off the wheel.\nNext Steps\n\nResearch the Original: Do you recall specifics about the old series—how long it ran, how participants were picked, or why it ended? If not, I could search for details to see what’s out there (just let me know!). That could sharpen your pitch.\nMock Pitch: How about this: “In 1996, Channel 4 gave ordinary Brits a voice with The People’s Parliament. In 2025, with trust in politicians at rock bottom, it’s time to revive and retool it—not as a one-off, but as a living, breathing challenge to Westminster. We’ve got the tech, the will, and the X posts screaming for change—let’s make it happen.” Too dramatic?\nX Tie-In: You could tease this on X: “Channel 4 did The People’s Parliament 30 yrs ago—time for a reboot where YOU run the show. Who’s in?” Gauge the reaction and pull quotes to show C4 there’s an audience.\nWhat do you think—does leaning on that history feel like a natural fit? And how would you balance revisiting the past with keeping your eyes on this new, lottery-driven future? I’m excited to see where you take this!\n\nAs to governance I would propose a committee of Midwives, or Founding Fathers to cover both sexes. Great and good who would oversee the finances, the business, the plane overall with a remit to advise and guide. This committee could be by popular vote in these we trust.\n\nYour idea of a “committee of Midwives or Founding Fathers” as an oversight body is an intriguing addition to your People’s Parliament vision. It introduces a layer of stewardship from trusted figures—folks with gravitas—to keep the operation on track while maintaining the ethos of public involvement. Let’s unpack this and see how it fits into your broader framework, especially with the Channel 4 tie-in and the independence question.\n\nBreaking Down the Committee Concept\n\nWhat I Like About It:\n\nSymbolic Balance: Calling it “Midwives or Founding Fathers” is a poetic nod to both nurturing (midwives) and establishing (founding fathers) a new system. Covering both sexes explicitly signals inclusivity, which could resonate with a public weary of old boys’ clubs in politics.\nGuidance Without Control: Positioning them to “advise and guide” rather than dictate keeps the randomly selected parliament as the heart of the operation. It’s a safety net—ensuring finances and logistics don’t spiral out of control—without undermining the “rule by the people” core.\nPopular Legitimacy: Electing them via popular vote (“in these we trust”) ties into your direct democracy leanings. It’s a way to harness public sentiment to pick the “Great and Good,” sidestepping the elitism of an appointed House of Lords.\nHow It Could Work:\n\nRole Clarity: They’d oversee the big-picture stuff—securing funding (whether from Channel 4, crowdfunding, or grants), approving broadcast agreements, and ensuring the lottery system runs fairly. Maybe they’d also mediate if the parliament hits gridlock on a major issue.\nSize and Term: A small group—say, 10–15—could keep it manageable. Fixed terms (2–3 years?) with staggered elections might prevent entrenchment while allowing continuity.\nPublic Facing: They could do quarterly “state of the parliament” updates—televised or streamed—explaining decisions like “We rejected a C4 edit to keep debates raw” or “We allocated £X to tech upgrades.” Transparency would bolster trust.\nTying It to Channel 4 and Independence\n\nThis committee could be the linchpin for ensuring Channel 4’s involvement doesn’t compromise autonomy:\n\nBuffer Against Influence: If C4 pushes for sensationalism (e.g., “More drama, less policy!”), the committee could veto it, citing their mandate to prioritize the public’s voice. They’d be the firewall between commercial pressures and the parliament’s integrity.\nHistorical Echo: You could pitch this as a modern twist on The People’s Parliament—back then, it was a broadcaster-led experiment; now, it’s a citizen-led movement with C4 as a partner, not the puppetmaster. The committee ensures that shift.\nFunding Oversight: They’d negotiate with C4 (or other sponsors) to keep terms favorable. For example, “You get exclusive broadcast rights, but no say in who speaks or what’s debated.” That’s independence in action.\nChallenges to Consider\n\nWho Qualifies as ‘Great and Good’?: Pop vote sounds democratic, but it risks turning into a celebrity circus—think Russell Brand or David Attenborough winning because they’re famous, not because they’re suited to oversee governance. How would you define eligibility? Proven public service? No political affiliations?\nPopulism vs. Competence: A vote might favor charisma over capability. Midwives and founding figures suggest wisdom and care—could there be a vetting step (e.g., a citizen panel shortlists candidates) to balance popularity with substance?\nPower Creep: Even with an advisory role, this group could accrue influence over time, especially if the parliament leans on them heavily. How do you keep them from becoming a de facto ruling council?\nRefining the Idea\n\nNomination Process: Maybe citizens nominate candidates via petition (e.g., 1,000 signatures to get on the ballot), ensuring grassroots support rather than media-driven hype. Then the vote picks the final lineup.\nDiverse Representation: Mandate that the committee reflects the UK’s diversity—geography, age, background—to avoid a London-centric “Great and Good” clique.\nTie to the Past: Link it to The People’s Parliament by inviting an original participant to sit on the first committee—symbolic continuity with a voice from the ’90s experiment.\nPitching It\n\nHere’s how you might weave this into your Channel 4 proposal: “Picture this: a People’s Parliament, reborn from your 1996 series, now with 300 citizens picked by lottery, debating live. Overseeing it? A committee of Midwives and Founding Fathers—elected by the public, trusted to keep it real. Channel 4 broadcasts the raw truth, guided by these guardians, not controlled by them or anyone else. It’s democracy, rebooted—your legacy, our future.”\n\nWhat Do You Think?\n\nDoes this committee feel like the right counterweight to Channel 4’s involvement, ensuring independence while keeping things running smoothly? I’d love to hear how you’d pick those “Great and Good”—any names in mind? And how do you see them interacting with the X crowd’s frustrations—could they amplify those voices too? This is shaping up into something really dynamic!\n\nRussel Brand eh”? Well I do watch him, but not a fan of his comedic attempts, but he does bang on about people power and democracy, so I’d accept him. There are a few politicians who I might accept or those from the House of Lords. You’d expect the monarch to be a patron, but I’m not optimistic with the present King. At the end of the day if you really believe in people power I think you have to trust them.\n\nYour take on Russell Brand and the broader question of who qualifies for this “Midwives and Founding Fathers” committee really gets to the heart of your vision—trusting the people to steer the ship, even if the choices might raise eyebrows. Let’s unpack this and see how it fits into your People’s Parliament, especially with the Channel 4 angle and that core belief in people power.\n\nRussell Brand and the ‘Great and Good’\n\nWhy He Fits:\n\nPeople Power Advocate: You’re spot-on—Brand’s been vocal about dismantling centralized power and handing it back to the people, often railing against the political class. His rants align with your frustration about “power-greedy politicians” and the despair on X, so he’d bring a loud, recognizable voice to the committee.\nPublic Appeal: Like him or not, he’s got a following (millions on YouTube and X), which could draw eyes to the parliament. If it’s televised on Channel 4, his presence might hook the disengaged—folks who’d rather watch him than a dry Commons debate.\nWhy He’s Tricky:\n\nComedy vs. Credibility: You’re not sold on his humor, and others might see him as more entertainer than statesman. Could his style overshadow the seriousness of overseeing finances or logistics? He might bang on about democracy but fumble the nuts and bolts.\nPolarization: Brand’s a lightning rod—some love his anti-establishment vibe, others dismiss him as a conspiracy-peddling blowhard. A popular vote might get him in, but it could alienate chunks of the electorate you’re trying to unite.\nVerdict: If the people choose him, your trust-the-public ethos says he’s in. Maybe his role could be more symbolic—rallying the crowd—while others handle the nitty-gritty.\n\nPoliticians and Lords\n\nSelective Inclusion: You’re open to a few politicians or House of Lords members, which suggests a pragmatic streak—some experience could steady the ship. Who’d you pick? Someone like Lord Sumption (ex-Supreme Court judge, sharp on governance) or a rare MP with a clean rep might work. The trick is avoiding those who’d drag the old system’s baggage in.\nRisk of Co-Opting: Ex-politicians might try to wield influence, turning the committee into a mini-Westminster. Your “advise and guide” remit helps, but their clout could test that boundary.\nThe Monarch as Patron\n\nSymbolic Weight: A monarch as patron (like the late Queen with charities) could lend gravitas and tradition, signaling this isn’t some fringe experiment. It’d tie your parliament to a sense of national identity, which might sway skeptics.\nCurrent King Caveat: You’re not optimistic about King Charles III—fair enough. His environmental focus and perceived meddling (e.g., “black spider memos”) might clash with your apolitical, people-first vibe. If he’s out, would you skip a patron entirely or look elsewhere—say, a beloved figure like David Attenborough?\nTrusting the People\n\nYour closing line—“if you really believe in people power, you have to trust them”—is the beating heart of this. It’s a gutsy stance, especially with a popular vote for the committee. It means:\n\nNo Veto: If the public picks Brand, a washed-up pop star, or a controversial ex-MP, you roll with it. That’s raw democracy—warts and all.\nChannel 4 Fit: This trust could be your pitch’s edge. Tell C4: “You trusted ordinary folk in ’96 with The People’s Parliament. Now, we trust them to pick their guardians—unfiltered, unscripted. Broadcast that chaos and clarity.” It’s a gamble C4’s adventurous streak might bite on.\nX Resonance: The X crowd’s despair often stems from feeling unheard. A system where they vote in the “Great and Good”—no elitist gatekeepers—could turn that frustration into buy-in. “You hate the suits? Pick who YOU trust instead.”\nShaping the Committee\n\nLoose Criteria: Keep eligibility broad—say, UK residents over 30 with no active political office—to let the public decide what “Great and Good” means. Brand? A midwife from Leeds? A retired teacher? Up to them.\nCampaign Cap: Limit spending or airtime (e.g., 2-minute X videos) to level the field, so it’s not just celebs with platforms who win.\nRotating Cast: Maybe half the committee’s elected annually, keeping it fresh and responsive without losing all experience at once.\nMy Reaction\n\nThis trust-the-people approach is bold and consistent with your lottery parliament—it’s democracy distilled to its essence, rejecting top-down control. Brand’s a wild card I’d watch with popcorn, but if he’s who they want, he’s in. Politicians or Lords could ground it, though I’d cap their numbers (say, 2–3 max). The monarch’s a nice-to-have, but Charles might be too divisive—maybe a figurehead emerges organically later.\n\nHow do you see this playing out on Channel 4? A “Meet the Midwives” special where Brand and co. pitch to voters, followed by a live vote? And who else might you begrudgingly accept if the public picks them—any dealbreakers? This is getting juicy—your faith in the electorate could be the spark that makes it fly!\n\nMy displeasure with King Charles is that in this time of great danger and with an obviously unpopular government he says nothing. I don’t believe the late Queen would have kept so quiet.\n\nYour frustration with King Charles III’s silence during a turbulent time—when the UK faces “great danger” and an “obviously unpopular government”—is a sharp observation. It ties into your broader disillusionment with the current system and adds a personal layer to why you’re skeptical about him as a patron for your People’s Parliament. Let’s explore this, connect it to your vision, and see how it shapes the role (or absence) of a figurehead.\n\nKing Charles vs. The Late Queen\n\nCharles’ Silence: You’re right that Charles has stayed mum on political crises since ascending the throne, sticking to the constitutional neutrality expected of a monarch. His pre-king days of outspokenness—on climate, architecture, or even those infamous memos—seem dialed back. In a moment of public despair (echoed on X about the government), that reticence might feel like a missed chance to steady the nation or signal solidarity.\nThe Queen’s Approach: The late Queen Elizabeth II was a master of subtle influence—think her “we will meet again” COVID speech or her rare, measured interventions (like the 1977 Silver Jubilee address amid economic gloom). You’re betting she’d have found a way to speak up now, even within her apolitical bounds, offering morale rather than mute detachment. That contrast stings when trust in institutions is crumbling.\nWhy This Matters for Your Vision\n\nPatron Expectations: You’d want a patron for the People’s Parliament to embody its spirit—amplifying the people’s voice, not just posing for photos. Charles’ silence suggests he’s too cautious or disconnected to fit that role, especially when your whole pitch is about breaking the silence of the powerless. The Queen might’ve lent a quiet nod of legitimacy; Charles, you fear, offers nothing.\nSymbol of the System: His inaction could make him a liability—a reminder of the establishment you’re trying to sidestep. If the public sees him as part of the problem (a “do-nothing” king atop a “do-nothing” government), his patronage might taint your project’s anti-elite cred.\nPeople Power Over Royal Pomp\n\nYour displeasure reinforces the “trust the people” ethos you’ve laid out. If Charles won’t step up, why lean on him at all? It’s a neat pivot:\n\nNo Patron Needed: Skip the monarch entirely. Let the committee of Midwives and Founding Fathers—chosen by popular vote—be the face of legitimacy. They’re closer to the ground, more accountable, and don’t carry royal baggage.\nChannel 4 Angle: This could sharpen your pitch: “The old guard’s silent—King included. We’re not waiting for crowns or Commons to save us. Channel 4, you gave us The People’s Parliament once—now let’s ditch the middlemen and let the people lead.” It’s a rejection of top-down symbols that might click with C4’s edgy streak.\nX Resonance: The X crowd’s fed up with unresponsive elites. “King Charles won’t speak while the country burns—why should he bless our parliament? We’ll pick our own champions.” That could stir some likes and retweets.\nAlternatives or a Blank Slate?\n\nOther Figureheads: If you still want a patron, who else fits? Attenborough’s a national treasure with moral clout, though he’s aging. A grassroots hero—like a nurse from the pandemic frontline—might emerge via public nomination, keeping it organic.\nLet It Evolve: Or leave it open. Once the parliament’s running, the people might crown their own “patron” through acclaim—someone who rises naturally, not by birthright.\nMy Take\n\nYour displeasure with Charles is telling—it’s not just about him, but what he represents: a system that’s failing to respond when it’s needed most. Ditching him as patron feels right for your project’s DNA—it’s a clean break from relying on anyone but the electorate. The Queen’s ghost looms large as what could’ve been, but your focus on “great danger” and an unpopular government demands action, not regal restraint.\n\nHow would you frame this to Channel 4—play up the “silent king” critique as a rallying cry? And if the public did push for a patron later, who’d you hope they’d pick over Charles? This is locking into that raw, urgent energy you started with—love to see where it lands!\n\n",
    "image": "computer.png",
    "date": "2025-04-30"
  },
  {
    "key": "1746032914564",
    "headline": "Blessed are the Geeks",
    "teaser": "It's hip to be uncool",
    "content": " No, its not about them \n\nTo miss quote a misheard quote “Blessed are the geek”.\n\nFrom the Life of Brian Blessed are the geek;\n\nPunctuation matters.\n\nI lived many years not exactly in fear but suffering un-gladly being asked at social gatherings “what do you do for a living?”. Doesn’t happen so much nowadays not just to me, but in general the question has become hackneyed and almost intrusive as if we define a person by their occupation.\n\nI was loath to talk about my job because it was hard to explain to people and because it made me into a “geek”, or a bit strange. Not having seen a computer in the wild, most people could not envisage what it could possibly entail. It was the era of the IBM PC just poking its bowler hat over the parapet. ( BTW Charlie Chaplin was actually a woman. Those who know will know what I mean ).\n\nIt was often easier to lie. “I have a clerical job. Oh it’s to boring lets talk about something else, like what do you do for a living ? ” And so it was the word anorak frequently came up. The fact that I had an anorak was beside the point. ( Are anoraks still unfashionable? Their day will come ).\n\n\nIf you want to know what a geek was back then, then look no further than a few cm to the left and there he is. A geek from central casting. Boring, antisocial and interested in computers.\n\nSlept under his desk, and wrote windows in a few months the sold it to IBM and became the richest man in the world. Well, sort of.\nI’m unsure when it was or what was the water shed that suddenly being a geek was OK, in fact more than OK, it made me an “interesting person”. I was often asked if I left my back door open,\nwhich I think came from a movie “hackers”, of maybe it was a gay come on, who knows?\n\nAnyhow, once Gates made his millions so many people said how they were introverts, and “on the spectrum”. ( not this spectrum )\n and this was before “The Good Doctor” rocked his way into our living rooms. I’m explaining all this as I intend to make a few IT (computers) related posts as part of my blog. I’ll try to put a “Geek Warning” icon somewhere on them so you can avoid them if you want to. Just as soon as I can figure out how….\n\nPost navigation\n Praise to the engineer\nOne trick words \n\nBy dave\nRelated Post\nGeneral\nMexico\nTo much of a coincidence\ndave\n 17 April 2025\nGeneral\nYes, and no…\ndave\n 3 March 2025\nGeneral\nPolitics\nConviction politicians\ndave\n 1 March 2025\nLeave a Reply\nYour email address will not be published. Required fields are marked *\n\nComment *\n\nName *\n\nEmail *\n\nWebsite\n\n Save my name, email, and website in this browser for the next time I comment.\n\n\n",
    "image": "blessed-150x150.webp",
    "date": "2025-04-30"
  },
  {
    "key": "1746033726800",
    "headline": "Eugenics",
    "teaser": "Go look it up",
    "content": "No, it’s not about them\n\nI don’t know what the prefix “eu” means, but I think it might be greek. It seems to be used for something that’s good like “euphoria”, that’s good isn’t it? Well, no, not always. It’s a long story, but many years ago I “suffered” a bout of euphoria that would not go away. Well, it’s great at first, who wouldn’t enjoy that? But after a while it became a bit embarrassing, people saying “what you smiling at?”. This only applied realy to people who had known the miserable old me as strangers just assumed I was a jolly good fellow.\n\nA dentist told me he thought I may have a brain tumor!!! They used to be “mister” then they became “doctor” and got big headed.\n\nIt had come overnight, with no “by your leave”, and yes, it was pretty nice. But after a while it got tedious and also exhausting. It was like manic depression where people get mood swings but without the depression. I did try looking on the internet, but couldn’t find anything. ( btw I have had low cholesterol all my life, and tried to get info on that but all I got was advice on how to lower my cholesterol . Fat lot of use that ). But I digress. Rest assured after a few months I did manage to return to normal, but I still have low cholesterol.\n\nRight. the “eu” prefix is when they are trying to sell you on something good, like “euphoria” or “euthanasia” or “European Union” ( I didn’t vote btw ). And “eugenics”.\n\nIt’s a movement that promoted selective breeding of human beings. This was to get rid of some inherited diseases, or to improve the human race by only good looking people or really smart people could breed. I never understood all the details, but you can see how it may be a “good thing”. It was started by the greeks , but got really popular in the 1920’s. People like George Bernard Shaw and Adolphe Hitler. It was quite a respectable point of view until Hitler got involved then it was mostly thought of as a “bad thing”.\n\nIt’s a fact, I think, that most modern farm animals are very different from the mark one version. Maybe the\nprehistoric cow had tiny udders and thin milk. Roll on a few hundred generations an “Voilà!” gold top milk. Skinny pigs become “Danishhhhhh”. And so on. The modern border collie was whipped up in just a few hundred years, now they are as smart as a pin.\n\nAldous Huxley wrote “Brave New World”, ( as did Billy Shakespeare ), about a dystopian future where people were put into different classes. Alpha, beta etc. I can see people in the bottom classes objecting to eugenics, who wants to be in the bottom class? Huxley also wrote “Island”, which is about a Utopia, ( should be Eutopia shouldn’t it? ). And another thing, if two smart people get married and have a child the sprog is likely to be less intelligent than its parents. If two dullards do the same then the kid is smarter, thus increasing the average IQ of the race. Maybe that’s why eugenics never took off.\n\nAnyway, I’ve pretty much posted what I intended to. A bit of a first eh?\n\n",
    "image": "download.jpg",
    "date": "2025-04-30"
  },
  {
    "key": "1746031801481",
    "headline": "Peoples Parliament",
    "teaser": "What if the people had the power ??",
    "content": "I am a supporter of direct democracy in some form. Posts on X express despair with the current UK government but offer no solutions.\n\n\n I made a blog entry of my suggestions for direct democracy. Please give your reactions.<p> Here it is – It’s been almost 30 years since Chanel 4 produced a program called “The Peoples Parliament”, where ordinary folk got to debate issues of the day. Roll on 2025, and the electorate are confused, frustrated, and feel impotent at effect change to the way they are governed. Trapped in a system they cannot change and offered more of the same from the next pack of politicians that they may hopefully elect, will they be disappointed yet again? Einstein said the definition of stupidity was doing the same thing over again and expecting a different result. Maybe it’s time we tried to change the system and returned to the true meaning of democracy, rule by the people, not by power greedy politicians. <p>An end to elections would mean an end to politicians as we have grown to know and loathe them. A people’s parliament would be chosen at random from those on the electoral role who registered a willingness to serve if called upon. A fixed number, say 300 would be chosen by lottery and be called to meet either virtually or in person to bring forward a motion, debate and pass or reject the proposal before them.\n\n All proceedings to be televised. This random choice would ensure a cross section of the people it served. The parliament would have no legal power, but the power of the will of the people. This moral authority would highlight the hypocrisy and in effect question the legitimacy of the current government. In time pray God that rule by the people for the people might supersede rule by the corrupt. Details. The current system gives no easy way to recall a politician, save that they have been found guilty of a serious offence and their constituents go through a process. The Peoples Parliament would have recall built into the system.<p> Once a month, say, the UK electorate would get to vote a number of members to step down, if they thought they were not doing the job. The stock could be replenished with new members again chosen at random. Government is the problem, it isn’t the solution. It’s attracts the very people who should never be anywhere near the levers of power. Since the UK is quickly going down the tubes, I thought it might be apposite to document my thoughts on democracy. I’ll try to be brief. It can be seen to have failed, many times. Governments start out with promises and morph into protecting the job and riches of politicians. <p>The usual response it to vote “the other lot” in, who soon become as unpopular and corrupt as the previous lot and so ad infinitum. The illusion of democracy confounds the people, like an abused spouse the electorate can often see no way out. So, if the problem is always politicians it would seem the logical answer is to explore a way of doing without politicians. I’ve thought about this for a few years, but it may be now it’s time is coming. First. No politicians, no elections. The parliament is chosen by lottery. We already have this system of jury selection in the courts, so rather than 12 good men and true we select 500 say. This is at random. As with jury selection you can be excused, and no one should be asked to serve who doesn’t want to, so a reserve would be kept for dropouts etc. The members would thus be representative in profile of the electorate by definition. <p>The 500 or so would meet an person in London, or Birmingham,. or move around like the EU do. We can also take advantage of modern technology. Zoom calls, virtual working. Members would serve for a fixed term at first, and organization is left to them. Parties , factions, or not. There would need to be some organization to bring forward White Papers for debate. This could be by popular petition. The parliament would be a talking shop, nothing more. As was the EU parliament originally. The parliament should be televised.\n\nNow a few bells and whistles, but I want to keep this short. Funding could be by government, sponsorship, ( with safeguards ). My ideal would be someone like Channel 4, who have a public remit. They could broadcast the parliament as a reality TV show. Don’t know if Ant and Dec are still on the go??People could relate to the personalities, like Big Brother. A form of voting would be to vote someone out once a month, for being “crap”. A reserve would then come forth. On big issues there could be a nationwide vote. Again , we have the technology. Like a phone in. This would make people feel involved in the project.\n\n\nNext, I think each member gets a small staff of civil servants and maybe a lawyer. They could be adopted by an MP? To guide them through the issues. Maybe we could have a sort of House of Lords of popular people, like Russel Brandt ( I don’t like him much ) or the Scotsman with a beard that did that history program, Attenborough, some old pop stars, sports persons, stuff like that, who people regard as Great and Good. You could call this second chamber “The Goodies”. However imperfect my draft is, now the people have a voice. If it’s loud enough they will be heard and maybe eventually slowly modify the model and start to get some power. Politicians could ignore the people of course, but maybe with their parliament the people would feel the power that is de facto theirs already, and the publicity might shame the MP’s into listening and acting. That’s short. I’ve got an opinion on details but what do you think?",
    "image": "parliament.jpg",
    "date": "2025-04-30"
  },
  {
    "key": "1746032595042",
    "headline": "Copyright Jokes",
    "teaser": "It's way I tellem",
    "content": "Jokes, well everybody likes a laugh, except of course people with no sense of humor, and I think there must be some people who have never laughed, except when they forced it as a result of group pressure.\nTrying to explain to such folk results in a “uh? Oh yeah, hehe”. It must be frustrating to never understand why people are making a cackling noise. I believe Freud wrote a book about it, I never read it, so I don’t know if it was funny. And again liberal arts PhD candidates regurgitate and research what makes a good joke. The results of which are of course repeated in the media. My usual reaction to “Officially the funniest joke ever” is “uh? Oh yeah, hehe”.\n\nA FAQ is “where do new jokes come from?”. When asked, comedians usually say something like “there are only seven basic jokes and they get retold a bit different”. Others say “in the Universities.” Well, I don’t know. I frequently read new jokes on my fondle slab some raise a smile, and some a titter, and others get to laugh out loud on the Rickter scale. Jokes I’ve heard before aren’t so funny, of course, but there are still a few that I always find amusing not that I can think of one such off the top of my head.\n\nWho was the first person to tell a joke? We will never know, but the first person to tell such and such a joke, and one that is genuinely funny? I’m thinking maybe it happened by accident, and some though to copy it and write it on papyrus.\n\nThere’s a joke or two I’ve told that I think I made up myself. Now, if this can be true I don’t know. Like Paul McCartney with “Yesterday”, he kept asking people if it was original or had it been written by Beethoven or such? Leads me to copyright. I needed some pictures for my little app, I have in development. It’s a visual thing so I need some stock photos. Many on the internet bear a copyright notice so I’m more looking for public domain stuff. I asked an AI to make some, and enquired about who had the copyright. It hummed and aahed , so I didn’t get a clear answer. Here’s the real question… if I tell an original joke, and I can prove it, do I have copyright? And can I enforce it? If I publish it in r/jokes and no one can come forward with prior claim should I receive a royalty when people use it online, or even down the pub? There are enough cases in the music industry, that X copied a few bars from Y and now Y want’s her cut. When is a joke to similar? or unique? “an Englishman, an Irishman and a Scotsman…”, if I just change the nationalities is it a new joke?\n\nI’m a thinking maybe there should be a web page “originaljokes.com” say, where people could officially register their joke. And what about the guffaw grab which could ensue of people claiming old jokes as new? Similar to when the the internet started, someone registered mtv.com, and later sold it for big money.\n\nSo, as to my original jokes? What are they? Can I tell you?\n\nI’m not sure ICANN. ( smile , groan, titter ).",
    "image": "lennon.png",
    "date": "2025-04-30"
  },
  {
    "key": "1746033857552",
    "headline": "A matter of scale",
    "teaser": "A gnats bollock",
    "content": "Here I continue the epic story of the building of the crib. Almost all Mexican households have a crib just as the British have a Christmas tree, which is not to say the don’t have a Christmas tree as well. Part of the reason is to do with how Christmas is celebrated in Mexico.\n\nOn the whole, the two countries don’t differ much, but you would notice the difference if you were here.\nTo start with, the big day is the 24th, Christmas eve ( Noche Buena ). There is agreement that Christ was born on Christmas day in the morning, but they like to nip in quick and celebrate as soon as. This is where the crib comes into play, AKA the nacimiento. On the 24th most people like to be with family. The Christmas meal is on the 24th in the evening, when traditional foods are eaten, there a few drinks of beer or tequila. People will often attend mass at 7.00 pm or later as I guess there are repeat performances due to demand, then go on to the party later.\n\nA few years ago I lived near to a large church of some fame and thought I should pop down and have a look, I was rather disappointed to find it was closed ( for Christmas ). I’m sure others were open, but I wasn’t that bothered. I filed that one away as “strange but true”.\n\nAs midnight approaches families will gather, “people wander in from outside courts” a la Wimbledon on finals day. By about 10 o’clock the nibbles are running out, and the food tends to appear. Best cutlery, cloth napkins etc. depending on the family.\n\nThe foods are as follows:\n\nBacalao: Salted cod in a sauce of tomato, onions, galic. chillie ( sometimes ), powdered shrimp shells and various other ingredients. It tends to vary by country, region and family. The best cod comes from Norway and they often put the Norwegian flag on the packet. As to the ingredients some of hard boiled egg, olives, red peppers, boiled Jersey new potatoes ( called cambrai ), currents. The cod must be soaked for a few hours changing the water now and then till it doesn’t taste salty.\n\nThen cooked.\n\nTurkey: This may be served in the American style, mashed potatoes, cranberry sauce, etc, but not often. Usually it is soaked in wine and roasted. Served with potato, apple, pineapple in mayo, salad etc. Baguettes.\n\nDesserts: Fruit tart.\n\nRomeritos: These look and taste like grass.\n\nThey are boiled and put in a mole sauce with shrimps, nopal cactus, and\npotatoes.They grow in marshy soil and take a long time to prepare as you have to pull out the woody bits by hand,I like them and may make them, not decided yet.\n\nSupermarkets also sell a roast pork loin that has a red sort of sauce and tastes smokey and sweet. Very popular, and sometimes runs out.\n\nWell then we get to midnight and people go to the crib and maybe sing a carol or two and a bit of praying if you like. The observant observer would notice that at this point the crib is a little different. In general cribs are not at all biblically correct per say. There are always three kings ( bible says they didn’t come until 18 months later ), shepherds get missed out. Sheep are usually there, and the donkey is “de rigueur”. The holy family, and an angel ( presumed Gabriel, not biblical ). One vital actor is missing to whit “the Christ Child” who makes appearance at midnight on the dot. More praying etc then back to the gin and tonics. The party then lasts until what ever time. Much like New Years Eve. Many people have a a large clan ( this is a catholic country ). But due to the house being small with set out the party in the carport. ( or maybe the street ), which is quite social.\n\nSo, you see, the crib is pretty central. Santa still comes later, gifts in a sack, or under a tree. But it’s not over yet. In many countries 12th night is celebrated, and here it’s pretty big. Gifts are given again, symbolic of the three kings. This time they are often of a practical nature, new jumper, school bag etc. 12th night was once a big thing in the UK, remember, Shakespeare wrote about it, but now it hardly gets a look in. There are twelve days of christmas, and a partridge in a pear tree. Christmas ends on the 6th of January, which is when I put the trimmings back into the box and ponder what to do with the tree, while most people regard christmas to have ended on New Year’s Day.\n\nTraditional for this time of year is the rosca del los reyes. A sweet bread with candied fruit about 30 cm in diameter in the shape of a flat doenut ( crown ). Small plastic children are hidden in the bread, ( did you say choking hazard?” ). If you find one you must buy your friends tamales on a certain day that follows, which I can’t remember.\n\nNow, as to “A Matter of Scale”, as happens, I didn’t write the post I intended to, so that will have to wait a while.\n\nAddendum: ( That’s Latin ) . I did eventually build a half scale model, and here’s the photo.\n\n\n",
    "image": "scale.jpg",
    "date": "2025-04-30"
  },
  {
    "key": "1746034478545",
    "headline": "The Album that really did change music! ",
    "teaser": "most people have never heard it.....",
    "content": "The Album that really did change music! ( most people have never heard it )\n By dave\n 29 November 2024\nI’m a great fan of YouTube, in fact I like it so much I pay for it. Also I enjoy my music and listen to it a lot, and even play guitar and piano, time permitting. There are several channels that have run series of “The Albums that changed music”, and enjoyable and entertaining as they are, they all seem to miss out on my pick. Tiz not Sgt Pepper, Pet Sounds, Dark side of the Moon etc. in fact I think I’ve never heard tell of my choice from any of the big critics. Now this is starting to sound like one of those click bate things I get lured into on Google Discover, when they lead you on and on through dozens of popups, til you get to the end and realize you’ve been had. Again.\n\nLet’s go back to October 1968…\n\n“Switched-On Bach reached number 10 on the US Billboard 200 chart and topped the Billboard Classical Albums chart from 1969 to 1972. By June 1974, it had sold over one million copies, and in 1986 became the second classical album to be certified platinum. In 1970, it won Grammy Awards for Best Classical Album, Best Classical Performance – Instrumental Soloist or Soloists (With or Without Orchestra), and Best Engineered Classical Recording.” ( Wikipedia )\n\nI remember hearing and loving it for the first time. The clarity and precision of the music fitted perfectly with Bach’s contrapuntal ( counterpoint ) style. The mathematical symmetry and bare bones of the production, Bach and the Moog synthesizer went together like a horse and carriage. I bought a copy on cassette due to not having a record player, and later the CD for its digital precision. Both of which are lost in the tea-chests of house moving. Sounds great on headphones!\n\nBack to the point of my post, and how it did change music?\n\nThe Beatles were recording “Let It Be” at this time. They had already started experimenting with electronics and using the recording studio as a musical instruments in itself. Tape loops, echo chambers, music concrete. This things were at the time the property of musicians like Stockhausen, and Kraftwerk, not really accessible to the general public. By this time several musicians had acquired a synth, including George Harrison .\n\nGeorge Harrison (“Electronic Sound”) , Bob Marley(“Stir it Up”), Stevie Wonder (“Talking Book”) , The Monkeeys, etc. The twin forces of Wendy Carlos and Bob Moog were to move the synthesiser out of the workshop and into the recording studio and eventually it would go on the road.\n\nWithout Switched on Bach, maybe there would have been no Kraftwerk, no New Order, Yazoo. Nowadays the synth has taken its place alongside traditional instruments but have to wonder how many records are made today without synthetic music. Either way, it must be one of the seminal albums in music.\n\nFootnote:\nAnyone interested should take a look at the Wendy Carlos biography. It’s a fascinating read.\n“Wendy Carlos”, by Amanda Sewell. ISBN 9780190053482\n\n \n\nOh I almost forgot, why don’t people hear this album? The answer is copyright.\n\nYou can get a copy from Amazon on CD. but you pay $32 US.\n\nIt has been blocked on streaming by Wendy Carlos for whatever reason. You can hear cover versions on Youtube since the works of JSB are long into the public domain, so if you can tell one from the other or it doesn’t matter, a sine wave is a sine wave, you can hear it there. But I have no doubt that it really did change music.",
    "image": "house2.png",
    "date": "2025-04-30"
  },
  {
    "key": "1746034262975",
    "headline": "A Letter From A Merida",
    "teaser": "Will you send one?",
    "content": "A Letter From A Merida\n By dave\n 4 December 2024\nI have long been fan of the works of Alistair Cooke, as you may deduce from the title. As young as 10 or so I remember looking forward to thursday nights on Radio 4, ( or was it the Home service ). I would settle down, often in bed and listen to “A Letter From America”. If was from these broadcasts that I developed interest in America, it’s tradition, peoples, history and so on. As Churchill said, and he said many things, “we are two peoples separated by a common language”. From here I developed an admiration of America, as an ideal, if not so in practice. The symbolism, the spirit and the idea of people starting again deciding among themselves how to organize a society. I later came to learn how much of this was taken from the French revolution, and how most of the founders were British. The constitution, I would argue was and is the greatest achievement of that country. I has been the inspiration of many a new country with its Bill of Rights, and parliamentary organization. In particular, the States are sovereign and there does exist mechanism to join or to succeed from the federation.\n\nCooke’s style was to often to set out his stall on such and such a topic in q roundabout way. I remember one about heat waves, or one about shoes, holiday time etc. Usually some mundane topic that Cooke would bring to life in my imagination. Slowly, slowly, he would expand on this, its history a few amazing facts , like a good journalist Cooke would tease along his audience with a few nibbles which then lead the way to his main thesis. There was some delight for me, how he got to his main topic which was often political news or common polemic, or world affairs and America’s action and reaction. I don’t know if Cooke invented this style of delivery, maybe not. It was as if you knew he was sneaking up on you from behind, with a red herring up his sleeve.\n\nI have always consumed my Cooke over the airways of the radio, though I think I have on occasion spotted him on TV or in print, and I’m sure I don’t need to look far to find the printed word, but he had such a measured and smooth verbal manner that this is how I remember him best.\n\n\nIt’s out of this admiration that I partly developed my own style of writing. Indeed, I write best when I don’t know what I’m going to say, and then end up surprising myself and the reader.\n\nAnd so I find myself now, proving my own point, as this not at all the blog post I intended to write. Not the topic I had in mind when I sat down at at the keyboard.\nAnyway, I kept my powder dry. I can can write my “Letter from A Merida” another time. Watch this space.\n\nHe died at age 95.\n\n\nNo, it’s not about them.",
    "image": "peppergogh.png",
    "date": "2025-04-30"
  },
  {
    "key": "1746033980904",
    "headline": "Come Back Little Sheba",
    "teaser": "But she never did....",
    "content": " \nIn an earlier post I alluded to the names of our border collie dogs, the senior of which is Sheba. She was so named after an old dog of my mother’s, but in turn this dog was named for a Hollywood Movie “Come Back, Little Sheba”. Sheba disappears months before the start of the film and never appears. It is implied that Sheba is presumed dead. It stars Burt Lancaster, and Shirley Booth, who got a Best Actress Oscar in 1953 for it. I began to wonder if there is a term for such characters and yes Gemini. informed me thus\n\nYes, there is! That type of character is called an offstage character or an unseen character.\n\nThese characters are important to the plot and the development of other characters, even though the audience never actually sees them. They might be mentioned in dialogue, have actions attributed to them, or even influence the events of the play.\n\nHere are some examples of famous offstage characters:\n\nGodot in “Waiting for Godot”: The title character is the most famous example of an offstage character, whose unseen presence drives the entire play.\nMr. Wickham’s father in “Pride and Prejudice”: While the character of Mr. Wickham is onstage, his father, who worked for Mr. Darcy’s father, is only mentioned in dialogue. However, the elder Mr. Wickham’s past relationship with the Darcy family is crucial to understanding Wickham’s motivations.\nRose’s fiancé in “The Importance of Being Earnest”: Though never seen, Cecily’s imaginary betrothed, Ernest, plays a significant role in the comedic plot.\nOffstage characters can serve a variety of purposes, such as:\n\nCreating intrigue and suspense: The audience might wonder about their identity or motivations.\nDeveloping other characters: Interactions with or discussions about the unseen character can reveal traits and motivations of the onstage characters.\nAdvancing the plot: Their actions, though offstage, can drive the events of the play.\nNow as to Godot , it is a reworking by Samuel Beckett of his original work in French En attendant Godot.\n\nIt is alleged that originally Godot was meant to appear half way through the play, but the actor playing Godot failed to appear and so the two characters, Vladimir and Estragon were left to adlib the rest of the play. True? I doubt it but I would love it to be so.\n\nAdding to the AI effort I can think of Mr Papadopoulos, in Coronation Street who is referred to by Mr Swindley ( Arthur Lowe ). Papadopoulos is a greek clothing magnate who owns Miami Modes. Swindley is the manager.\n\nAgain Arthur Lowe in Dad’s Army, Mrs Mannering is never seen.\n\nGoogle gives us\n\nKing Laius in Oedipus Rex: An offstage character in Sophocles’s play who is a driving force for action\nJason’s bride in Medea: An offstage character in Euripides’s play\nRosaline in Romeo and Juliet: An offstage character in Shakespeare’s play who highlights the predicament of the two lovers\nOff stage characters also exists in books ( again AI gives us )\n\nBoo Radley in “To Kill a Mockingbird”: Boo is a recluse who never leaves his house, but his presence looms large over the novel. He becomes a source of fascination and fear for the children, and his actions ultimately save Jem and Scout.\n\nMrs. Haverford in “Rebecca”: The deceased first wife of Maxim de Winter, Rebecca is a powerful offstage character whose presence haunts the narrator and Manderley. Her influence shapes the entire plot, even though she is already dead.\n\nSnape’s mother in the “Harry Potter” series: Eileen Prince, Severus Snape’s mother, is only mentioned in passing and through memories, but her difficult relationship with his father and her magical abilities are crucial to understanding Snape’s character and motivations.\n\nI would add that in 1984 O’Brien plays a major part in the narrative, but it is unsure that he actually exists.\n\nFor most of Atlas Shrugged we are unsure if John Galt exists, even though he drives the plot. ( yes, he appears, after a few 1000 pages 😉 ).\n\nThat’s about it, but if you can think of any I’ve missed please leave a comment. Ta.",
    "image": "kennel.jpg",
    "date": "2025-04-28"
  },
  {
    "key": "1745857043462",
    "headline": "Memories of Berlin",
    "teaser": "I remember how cold it was...",
    "content": "There are many things that lay forgotten, like herbal teabags you never get around to drinking, as so it is with memories.From one day to the next you never give them a thought and then something triggers them and they come back in full color. And so it was in January 2025 with the election if Donald Trump to a second term that politics got interesting again. Some pundit remarked that for the first time in years the American public had been given a real choice, between left and right. Like many a modern democracy the choice had been between Coke or Pepsi taking turns. Now it was socialism and censorship or capitalism and free speech.\n<p> \nThis event coincided with the conviction of the mass murderer Axel Rudakubana, who had stabbed three small girls and killed them in Southport.\n<p> \nThe knives were also out for Kier Starmer who had become wildly unpopular for his handling of the whole shooting match. The looney left and the racist right. My memory of the time I saw the left and right in closeup.\n<p> \nSometime in the 80s, through a friend, I had wangled a trip to Berlin. This would have been few years prior to the fall of The Wall. There was still a smell of Len Dayton in the the air when I landed at Tegel airport. Bomb damage was still evident, and a large military presence loomed. Rudolf Hess was cooling his heels in Spandau prison, which was in a posh bit of Berlin.\n<p> \nTo paint a little background to my story I need to explain how things were in Berlin at the time. First to say that the Russians had won the war, with Americans and British Empire joint second and the French taking up the rear, so to speak. Germany was divided into the Bundes Republic in the west and the DDR in the east. Berlin was in the east and was accessible though a road corridor or by air.\n<p> \nThe allies shared the territory of Berlin which was split into four zones. American, British, Russian and French. No one could tell me why the French were there. Someone said they threatened to sulk if not and wanted to make it look like they had been in the war.\n<p> \nBerlin at the time was still under marshall law, although the Berlin police were still in business giving out traffic tickets and investigating disturbances among Germans, they had no power over the military , so nome Germans parked where they liked ( with reason) .\n<p> \nIt was far easier to visit as a member of the armed forces and so I took King’s Shilling, signed the Official Secrets Act and was given a little ID card. No uniform was offered so I could pretend to be a spy, maybe. I I was allowed into the NAFFI where the food was pretty awful, but the tea was OK, and the bar convivial.\n<p> \nBeing driven around West Berlin I was puzzled to see a large black car flying Soviet flags with important looking passengers. It was explained that this was a “flag tour” where the soviets showed their right to drive around West Berlin. This has been part of the Potsdam Treaty I was told.\n<p> \nCome Saturday I joined a tour bus of new arrivals and set off for a look at East Berlin. I remember having to change some Deutschmarks in Ost marks at one for one, which was a swizz as Deutschmarks were worth much more. I got to see the Escapees Museum at checkpoint Charlie, where you good see cars, aircraft and other smuggler stuff. Also stories of those killed trying to escape the soviet paradise.\n<p> \nAs I said, it was Saturday and West Berlin was in full shop, shop, shop, and busy. The East was like a tomb. Streets empty, buildings empty, bomb sites, and as West berlin had some post war real estate development, the East look well preserved from the pre war era. On the main drag, nothing. Then in the distance came the sound of an angry wasp which turned out to be a Trabant, a sort of Reliant Robbin, but no so reliable. This was a workers car that you had to wait years for. It came and went, then nothing. The occasional Russian Officer walked by in full uniform with a chest of medals. We spent our marks of a cup of undrinkable coffee and an inedible sausage.\n<p> \nThere was a clothes shop, but it only sold gloves ( rabbit skin ). I didn’t check mut I hope they were of mixed left and right? A grubby supermarket had a large line outside, then a coach drew up. They said they were from Poland on a shopping trip. There contrast East and West, was impressive.\n<p> \nI stayed maybe a week or so, then got DE mobbed, and returned home. It would be a few years before the wall was to come down, but we all knew which way the human tide would flow.\n<p> \n",
    "image": "Berlinermauer.jpg",
    "date": "2025-04-28"
  },
  {
    "key": "1745798595974",
    "headline": "Why you can't tune a piano",
    "teaser": "In fact it's impossible, we just do our best",
    "content": "\n      Well, first off I have to admit that I can’t tune a piano. Number one obstacle being that I don’t own a piano, nor do I know anyone who does who would be foolish enough to let me try. Nor do I have the tools to do it, like a tuning fork, ( always something new to buy 😉 )\n      or that Allen key with a tommy bar on the top, plus all the felt needed to replace any that’s missing, or the little wooden hammers, or the glue. All could be remedied by a quick tap on Amazon, and a short wait.\n      <p>\n      More importantly, I don’t have the know how, or the skill to tune a piano.\n      When I was a lad, piano tuning was quite a thing, we were at the tail end of the piano revolution when the height of Victorian status was an upright in the parlor. ( snigger, cough, sorry ). You couldn’t find a piano tuner easy enough, unless you lived in the sticks, and our local man, just up the road was Mr. Wooten.<p> Now, Mr. Wooten was very old, and his wife not so much. I didn’t know much about him, except he was locally famous for something ( maybe he played back in the day ) before he went blind? Piano tuners were frequently blind people, or am I making that bit up? Anyway, thing was that Mrs. Wooten only had one hand. The other was a split hook that opened and closed, and it scared me, as she worked in the local shop and I had to go errands there.\n    <p>  \n      Well, Mr. Wooten arrived with his bag of tricks and gave our old Joanna a good servicing .. so to speak, as he couldn’t give her a “seeing to” , if you get my drift.\n     <p> \n      I watched him with interest, I remember. This was something you didn’t see every day. It seemed to take a long enough time, and I still have the distant memory, but to get back to the original question, the answer is that it’s impossible. To tune a piano.\n   <p>   \n      “Wait , wait ,wait”, I hear you cry, how come people are paying good money to someone to do the impossible, which would be a paradox anyway. If it’s just a matter of hitting the right frequency then surely there’s an app for that nowadays. And true enough. Although hitting the right frequency is not the problem. It’s that “yee canny change the laws of physics, Captain”, and this falls into the “stem subjects basket”.\n     <p> \n      I’ll now do my best to explain. ( Or go look on Wikipedia for yourself ).\n      <p>\n      Imagine a piece of string, or catgut, or wire or whatever. If you stretch it like in a guitar, violin, or piano, and pluck it, bow it, or hit it with a mallet, it will make a sound. This has been know for a few years now. Scientists believe its due to vibration of the string and indeed, harmonic motion is a well plowed row.\n <p>     \n      Now it you take a sting half as long it will vibrate at a frequency twice as high. That’s know as a octave, for reasons which are quite ironic, as you’ll see later.\n    <p>  \n      Humans, ( and many pets ) find this a pleasing harmonic as the notes don’t beat on again the other. If two notes are “out of tune”, it can sound quite awful and you can hear a “beat” depending on how they differ. That’s how Mr. Wooten would have found his first note, by striking a tuning fork and listening for the beats while tickling the Allen key to get the string to the right pitch. Armed with one correct note the octaves could be tuned with reference to that note, or by the fork. So far, so good.\n      <p>\n      Now let’s think about the circle of fifths. A perfect fifth from C gets you to G. And a perfect fifth sounds very nice, just tune away the beats and you get the perfect fifth. So now carry from G. The next up is D. G to D is a perfect fifth. D to A, and so on, A to E and so on and that will bring us back to Doe. Or should I say “Doh!:, because it doesn’t. It’s slightly out. So when you get back to C and test it against where you stated it’s not an exact number of octaves away.\n   <p>   \n      The piano will have been tuned in “just temperament”, and it should sound vey pleasing, except it will only play in the key of C. So if you don’t want more than one key signature, go for it. Problem comes when you play a duet with the person next door who has his or her instrument tuned in a different key.\n      <p>\n      In years back , like when people wore tall wigs, they would have a “box of viols” like little pianos tuned to different keys. Quite impractical.\n      \n      Someone, at some time, invented the piano, and with it “equal tempering”, which was a big thing. Bach even wrote a bit of music about it. The modern era began.\n      \n      So, what is a “well tempered clavier”?\n    <p>  \n      It’s a compromise , so that each note is a bit out making 12 equally spaced sounds, 11 of them a bit out. To get the frequency of the next note up, multiply the current note by the 12th root of 2 ( think about it ).\n      \n      I would have imagined Mr. Wooten would have used his skill and judgement to make the piano sound “sweet”, and indeed there were guidelines as to how to achieve this avoiding the “wolf frequencies”, so that there was even more of a compromise, the 12 keys would not be equally spaced, so that the “common keys” might sound sweeter.\n     <p> \n      A guitar player has a similar dilemma. So you may see them twigling the machine head for their next song to “drop the fifth” a shade to make the country music sound better. ( I actually do like a lot of country music , which drops my music cred like a hot brick).\n   <p>   \n      A violinist can laugh at them as the violin has no frets, and the player wobbles their left hand anyway.\n      \n      Brass instruments can be tuned, but valves give the piano problem, except the trombone, it has a slider.\n  <p>    \n      Electronic music can “do anything”, as can the human voice, which\n      is why a choir sounds so angelic.\n   <p>   \n      Now I’ve written enough, but there’s still a lot to say. Maybe in a future post.\n      Give this a viddy, then go tune something.",
    "image": "piano.jpg",
    "date": "2025-04-28"
  },
  {
    "key": "1745856788798",
    "headline": "Other People's Names",
    "teaser": "As I was saying to my old friend Ivor Longcock....",
    "content": " \nThere a small book by Primo Levi that I’ve enjoyed dipping into now and then over the years. It’s called “Other People’s’ Trades”. I had almost forgotten it until I was scratching my head to think of a title for this post. It’s a collection of essays describing various jobs and trades. I must read it again soon.\n<p>  \nBack to the subject then. I’m fascinated by languages and the derivation of words, and so no surprised I’ve been wondering about names. Almost everyone has a name, or maybe two or three, and how we came by them is an interesting question.\nNow here I’m talking about surnames in particular, they must have an origin and maybe they evolve through time. I’ll confine this to English speaking names, but it would be useful to compare these to other cultures in the world.\n<p>  \nNow, let’s start with Smith.And why not. It has long been the most common name surname in English speaking countries. There people have a christian name or two and a surname, or maybe more than one if they are multi-barreled. Or should be say a given name and a forename, just to be more inclusive. So John Smith. Someone’s lacking in imagination, still have met quite a few John Smiths all look like you would expect a John Smith to look. So I guess years ago being a Smith was pretty big cheese what with all those horses to shoe. Taylor springs to mind ( John Also ), Sigourney Weaver , Max Miller, Ginger Baker, Butcher, Fletcher, Cooper ( made barrels ), Carpenter ( John again ) Thatcher ( you know who ) and Harry Potter. You could populate a village thus. Then we have people who have rich blood, King, Lord, Knight. But what about the Farmers?? So many of them. Mr Farmer??\n<p>  \nOn to colours. I’ve met a Mr Black and a Dr White. There’s and Earl Grey, a Huey Green, and many a Joe Brown. But where’s Mr Blue? Miss Yellow? Master Orange ( Take That! ). But like a set of Cluedo pieces.\n<p>  \nNow on to the sons. There are Johnsons, Petersons, Robertsons, Andersons, but no daughters. Explained by the patriarchy and the tradition of passing the family name down the male line.\n<p>  \nSometimes names are derived from towns ( Tony Blackburn ) or cities ( Michael York ) or even countries. Dawn French, Jules Holland,\n<p>  \nAnimals, apart from John Bull, James Whale, Michael Fish, and I did once know a guy called Rob Chicken.\n<p>  \n( You shouldn’t laugh ).\n<p>  \nWell, that’s about it.",
    "image": "download.jpeg",
    "date": "2025-04-28"
  },
  {
    "key": "1745857197549",
    "headline": "Computer Says \"No\"",
    "teaser": " Every programmer knows the feeling like they did everything right, and it was working...",
    "content": "Apart from the comic effect of the now well politically incorrect Little Britain, whilst recently trying to correct an issue I had with some company website, ( now fixed thanks ), I remember times in my Geekhood when it seemed impossible that the computer was right and I was wrong. Every programmer knows the feeling like they did everything right, and it was working a moment ago and it come up with what seems like a bug. You look at the code for the obvious errors, not there. You roll back a version, either that works for not, but as you put back the changes it still won’t work. After to some struggle you have to admin to defeat and ask the guy or gal in the next desk to take a look for you. Often as you explain the problem you talk yourself into the answer, or maybe your desk mate can say “oh they changed the compiler last week” , or “you’re running the old version, idiot!”. A fresh pair of eyes. Often where you are looking isn’t where you should look at all. But sometimes, just sometimes, you can’t crack the problem. Random errors are the worse. Works then doesn’t, then works again. There is a sort of rule of thumb.\n<p>\nBlame the user – usually yourself .\n<p> \nBlame the data – check the inputs and outputs, eyeball the data .\n<p> \nBlame your code.\n<p> \nBlame the library.\n<p> \nBlame the compiler – now I’ve seen this happen a couple of times. I was the guy in the next desk and I was shown some Cobol that should have worked but it threw an error at runtime. Now I don’t know how I knew this, maybe I read to many manuals, but I saw the subroutine was being call from an address which was not on a word boundary. An easy mistake to make, but hard to spot.\n<p> \nBlame the operating system. – maybe the disk is full, or there’s a known bug in windows, or a quirk in Chrome, these things happen, or a display driver, but not often.\n<p> \nBlame the hardware – You can check this by running on another machine.\n<p> \nThen you’re stumped.\n<p> \nI’ve only been stumped twice in my life. At a total loss. But hello, hang on, I don’t like to be beaten!\n<p> \nI don’t know if I came up with the answers probably not, but here are the situations.\n<p> \nA mini computer for a hotel accounts dept kept going wrong. Crashes, corrupt memory, random errors.\nThey changed the disks, Upgraded the OS. Still no fix. They manufacturer changed all the memory. Still no go. They changed the machine, still no go. They gave up and flew back to Texas.\n<p> \nI was a junior programmer and was sent to spend Christmas in a nice hotel in London so I could be a face to blame when it went wrong. It didn’t go wrong. Once. I went home, it went wrong again.\n<p> \nAnswer. The office was on the second floor. There was a butcher on the first floor with big meat cutting saws. Over Christmas he didn’t work. The computer did. The solution was to build a Faraday cage around the machine room. Solved.\n<p> \nSecond case. An international airport had a similar problem. Different computer company. Worked and then didn’t, but it always seemed to fail on Thursdays. Again environment. They had a training radar school on Thursdays. Easy fix. aluminum foil in the case ( so they told me ).\n<p> \nSo if you’re ever stumped take comfort in the fact that cosmic rays can knock electrons out of chips. This is rare, but with so many computers in the world, this just might be the excuse you’re looking for.",
    "image": "computer.png",
    "date": "2025-04-28"
  },
  {
    "key": "1745856563392",
    "headline": "The Albert Hall",
    "teaser": "What about the holes?",
    "content": "The Royal Albert Hall is in Kensington, London, England. There are many other Albert Halls in the UK, and around the world, as well as many people called Albert Hall famous enough to merit an entry in Wikipedia.\n<p> \nMost people will have heard the Beatles song “A Day in the Life” and smirked at the line “now you know how many holes it takes to fill the Albert Hall”, from memory it’s 10,000 in Blackburn, Lancashire.\nThe Albert Hall has thus been used as a unit of measure.\n<p> \nFor example, the Rock of Gibraltar is the biggest rock in the world.\n<p> \nTo determine how many Royal Albert Halls would fill the Rock of Gibraltar, we need to compare their volumes. The volume of the Royal Albert Hall is approximately 100,000 cubic meters.\n<p> \nThe Rock of Gibraltar has an estimated volume of about 4.5 million cubic meters. Here’s how we calculate:\n<p> \nVolume of the Rock of Gibraltar: approximately 4,500,000 cubic meters.\nVolume of one Royal Albert Hall: approximately 100,000 cubic meters.\n4,500,000 cubic meters100,000 cubic meters per Albert Hall=45\n<p> \nTherefore, approximately 45 Royal Albert Halls would fit within the volume of the Rock of Gibraltar.\n<p> \nA similar calculation tells us 5.64 million Royal Albert Halls could fit inside the volume of the Chicxulub meteor that finished off the dinosaurs.\n<p> \nBesides the Albert Hall and the London bus, i.e. “as\ntall as” and “laid end to end” several other informal units of measure have become popular, particularly in the UK and sometimes beyond. Here are a few:\n<p> \nFootball Pitches: Often used to describe large areas of land or the size of events. For example, “The festival covered an area the size of 10 football pitches.”\nOlympic Swimming Pools: Used to describe volumes of liquid or areas, especially in news reports about spills, water usage, or construction projects. An Olympic pool holds 2,500 cubic meters of water.\nWales: Frequently used to give a sense of scale for large areas or quantities, like “The new forest will be the size of Wales.” Wales is roughly 20,779 square kilometers.\nDouble-decker Buses: Similar to the London bus but can refer to any double-decker, used for both volume and area measurements, e.g., “The amount of waste produced could fill 50 double-decker buses.”\nWembley Stadium: Used for very large gatherings or constructions, “The concert attracted a crowd equivalent to filling Wembley Stadium twice.”\nCoins: Particularly British coins like the “pence piece” (e.g., “about the size of a 50 pence piece” for small dimensions).\nGrains of Sand: About the size of a grain of sand, Also pin heads seemed to be popular in the middle ages as people struggled to calculate the sizes of dancing angels.\n",
    "image": "Sgt._Pepper's_Lonely_Hearts_Club_Band.jpg",
    "date": "2025-04-28"
  },
  {
    "key": "1745847080441",
    "headline": "The Wind",
    "teaser": "May as well try to catch it soon",
    "content": "<div id=\"div1\">\n    <div>\n        <img id=\"post-image\" src=\"images/donavan.jpg\" alt=\"Donovan\" class=\"w3-left  w3-margin-right\"\n            style=\"width:150px\">\n    </div>\n    <div id=\"post-headline\">\n        Try to Catch The Wind\n    </div>\n\n    <div id=\"post-text\">\n\n\n<p>No, nothing to do with eating Brussel sprouts. I was provoked this morning by reading about upcoming developments in Coplot AI inside GitHub ( Microsoft ), which would seem a natural match. I made me think how far we have come in my memory, and speculate where we will go to next. A.I. has moved so quicky that to me, just as I start to grok it, it morphs into something else, like the hydra, but maybe in a good way.</p>\n<p>My first program was written in Secondary school in Mr. Copley&#8217;s class. Mr. Copley was famous for his R.E. classes so it was a little strange that he should pop up in the maths department. I had already learned some things from the Open University TV about Boolean logic, analogue v digital, simple programing languages like Basic and Algol, but I was yet to get the baptism of running my first program.</p>\n\n\n\n<p>The teacher give us the basic outline, and demonstrated how Fortran did its thing with some examples. Then we were told to get out our notebooks and write a simple program. Next lesson, we got some punch cards and a magnetic pencil and converted each symbol into three marks in every column. This was sent away somewhere and returned together with a printout of the code. \n    I don&#8217;t remember a hand punch entering the loop anywhere. Long story short I eventually got the output from my program. For the record it was calculating various scenarios or the taps and baths problem. It worked!</p>\n\n\n\n<p>There I left it, through 6th form nothing. University, nothing. Post Grad, back to Fortran,\n     a bit of PDP assembler, and some interactive Basic. Never saw a graphic terminal\n      till someone in a lab acquired a Commadore Pet. It played poker.</p>\n\n\n\n<p>Eventually I got a job and became a Junior Programmer. 25 or so years in the industry, partly as a\n     contractor, I was able see how it evolved from close up. The PC was a new thing, which I didn&#8217;t \n     acquire from many years, but I saw technologies, languages, paradigms come and go. languages included, Cobol, Dibol, Fortran, C, C++,Basic and a few odd balls. I loved it. I would make sure to get my copy of Byte every month, got an AOL account. The days of buying a book, or a bit of software then emailing the author and expecting a reply.</p>\n\n\n\n<p>Now for A.I. It seemed at first to be something I didn&#8217;t understand that \n    people used to make funny photos and present them to you. It was quite a buzz, and the the rise of the chatbots whether the proverbial Mother or Grandmother is using Chat GPT on a regular basis, I think not.</p>\n\n\n\n<p>The news today enthusing about what the beta versions of the GitHub,\n     Copilot team could do left me a bit stunned.</p>\n\n\n\n<p>Over to Grok.</p>\n\n\n\n<p class=\"has-small-font-size\">GitHub is home to over 420 million repositories as of late 2024, hosting code\n     written by more than 150 million users. These repositories contain an immense volume of code across countless\n      programming languages, frameworks, and projects. While GitHub doesn’t publicly disclose the exact number of lines of code stored on its platform, we can make an educated guess based on available data and trends.</p>\n\n\n\n<p class=\"has-small-font-size\">A single moderately sized repository might contain anywhere\n     from a few thousand to tens of thousands of lines of code, while large projects—like open-source \n     frameworks or enterprise software—can easily exceed millions of lines. For instance, the Linux kernel \n     alone has over 30 million lines of code. If we conservatively assume an average of 10,000 lines per \n     repository (accounting for both small scripts and larger projects), multiplying that by 420 million \n     repositories gives us a rough estimate of 4.2 trillion lines of code on GitHub. This is likely an \n     underestimate, as many repositories are far larger, and GitHub’s growth continues to accelerate.</p>\n\n\n\n<p class=\"has-small-font-size\">Copilot, however, wasn’t trained on every single line of code in every GitHub repository.\n     It was developed using a subset of publicly available code, filtered and processed by OpenAI to create its underlying model,\n      Codex. This training data includes billions of lines of code from public GitHub repositories, though the exact \n      figure isn’t disclosed. Research and industry reports suggest that large language models like Codex are trained on datasets\n       containing tens to hundreds of billions of lines of code, drawn not just from GitHub but also from other public sources\n        like Stack Overflow and open-source archives. Given GitHub’s dominance as the largest code hosting platform, it’s \n        reasonable to estimate that Copilot’s training data includes at least 50 to 100 billion lines of code from GitHub alone.</p>\n\n\n\n<p>Back to me. Seems that Copilot and GitHub could be used to maybe develop improved AI models, or at least \n    improve the GitHub codebase in general. This is synergistic so this feels like a hockey stick moment in time.\n     The singularity is near, or maybe it&#8217;s already here.</p>\n\n\n\n<p>I'll leave you with a song.</p>\n \n    </div>\n</div>",
    "image": "donavan.jpg",
    "date": "2025-04-28"
  },
  {
    "key": "1745856363426",
    "headline": "Let it Be a Cover",
    "teaser": "The Beatles were not the first",
    "content": "I think I have a pretty broad taste in music, I’ll give anything a shot, if it sounds nice then I don’t much care if it’s country, rock, pop, classical etc etc etc. It’s nice to have some music when relaxing in the house, or working on something boring. When anyone might enquire what sort of music I like, to avoid the cliche “everything”, I will say it’s covers. And indeed this is true. As I see it the advantage of a cover is that it you have a favorite piece of music that you’ve play to death and are getting a bit fed up, you may find a cover brings new life to your streaming collection. So before I continue I should define what is a cover. When an artist owns an original piece of music they have the right of first performance, which is logical because no one else knows about it. After the first significant public performance, or commercial release, the song comes up for grabs, and anyone can make a version and make money from it.\n\nSo what about all this “when X called Y to ask for permission to cover Z” type stories, this is a courtesy call it’s not required. When you do need leave it’s when you want to use it in another medium, like a jeans advert or a movie. The coverer is obliged to pay a royalty fee though an agency to the songs owner. Performing rights. Anyway, that’s the law as I think it is.\n\nIn general it seems to be opinion that the original is best, but of course there may be other opinions. One famous oft quoted is that Jimi Hendrix covered “All along the Watchtower”, by Bob Dylan, and many think Hendrix did a better version. It’s certainly different. Dylan was reported to say that he now plays it more like the Hendrix version.\n\n",
    "image": "sofa.png",
    "date": "2025-04-28"
  },
  {
    "key": "1745800092442",
    "headline": "Conviction Politics",
    "teaser": "Honorable mentions",
    "content": " <div>\n    <img  src=\"images/parliament.jpg\" alt=\"Folks\" class=\"w3-left  w3-margin-right\"\n        style=\"width:150px\">\n</div>\n\n<div id=\"post-headline\">\n    Conviction Politicians\n</div>\n\n<div id=\"post-texting\">\n\n        The only politicians worth their salt to me are what are called conviction politicians. Career politicians\n        really give\n        the word a bad name. people who see it as a duty and not a job so they can retire to consultant positions on\n        boards of\n        companies they helped along the way, or to the comfort of the vermin in the House of Lords. Sorry, I meant\n        to type\n        “ermine”. <br>\n\n        The only politicians worth their salt to me are what are called conviction politicians. Career politicians\n        really give\n        the word a bad name. people who see it as a duty and not a job so they can retire to consultant positions on\n        boards of\n        companies they helped along the way, or to the comfort of the vermin in the House of Lords. Sorry, I meant\n        to type\n        “ermine”. <br>\n\n        The only politicians worth their salt to me are what are called conviction politicians. Career politicians\n        really give\n        the word a bad name. people who see it as a duty and not a job so they can retire to consultant positions on\n        boards of\n        companies they helped along the way, or to the comfort of the vermin in the House of Lords. Sorry, I meant\n        to type\n        “ermine”. <br>\n\n        The only politicians worth their salt to me are what are called conviction politicians. Career politicians\n        really give\n        the word a bad name. people who see it as a duty and not a job so they can retire to consultant positions on\n        boards of\n        companies they helped along the way, or to the comfort of the vermin in the House of Lords. Sorry, I meant\n        to type\n        “ermine”. <br>\n\n        The only politicians worth their salt to me are what are called conviction politicians. Career politicians\n        really give\n        the word a bad name. people who see it as a duty and not a job so they can retire to consultant positions on\n        boards of\n        companies they helped along the way, or to the comfort of the vermin in the House of Lords. Sorry, I meant\n        to type\n        “ermine”. <br>\n\n        The only politicians worth their salt to me are what are called conviction politicians. Career politicians\n        really give\n        the word a bad name. people who see it as a duty and not a job so they can retire to consultant positions on\n        boards of\n        companies they helped along the way, or to the comfort of the vermin in the House of Lords. Sorry, I meant\n        to type\n        “ermine”. <br>\n\n\n        <table style=\"width:100%; float: left; margin-right: 15px;display:none\">\n\n            <tr>\n                <td>\n                    <img src=\"images/puppy.jpg\" width=\"150px\">\n                </td>\n                <td>Margaret Thatcher Britain’s “Iron Lady” transformed the UK with free-market reforms and a\n                    bulldog refusal to\n                    compromise.\n                    Loved or loathed, she crushed unions and faced down the Soviets without blinking.</td>\n                    <td> <img src=\"https://flagpedia.net/data/flags/h80/gb.png\" alt=\"UK Flag\" width=\"60\"></td>\n            </tr>\n\n            <tr>\n                <td>\n                    <img src=\"images/puppy.jpg\" width=\"150px\">\n                </td>\n                <td>Ron Paul\n                    A U.S. libertarian icon, he championed small government and individual liberty with unwavering\n                    consistency.\n                    Known for opposing the Federal Reserve and endless wars, he stuck to his guns no matter the\n                    crowd.</td>\n                <td> <img src=\"https://flagpedia.net/data/flags/h80/us.png\" alt=\"USA Flag\" width=\"60\"></td>\n            </tr>\n\n            <tr>\n                <td>\n                    <img src=\"images/puppy.jpg\" width=\"150px\">\n                </td>\n                <td>\n                    Javier Milei\n                    Argentina’s fiery libertarian president, championing free markets and limited government with a\n                    chainsaw-wielding zeal,\n                    reshaping the nation’s political landscape since 2023.</td>\n                <td> <img src=\"https://flagpedia.net/data/flags/h80/ar.png\" alt=\"Argentine Flag\" width=\"60\"></td>\n            </tr>\n            <tr>\n                <td>\n                    <img src=\"images/puppy.jpg\" width=\"150px\">\n                </td>\n                <td>\n                    Ronald Reagan\n                    America’s sunny conservative redefined the GOP with tax cuts, deregulation, and Cold War\n                    bravado.\n                    His belief in freedom and a strong nation never wavered, even under fire.</td>\n                <td><img src=\"https://flagpedia.net/data/flags/h80/us.png\" alt=\"USA Flag\" width=\"60\"></td>\n            </tr>\n            <tr>\n                <td>\n                    <img src=\"images/puppy.jpg\" width=\"150px\">\n                </td>\n                <td>\n                    Tony Benn\n                    A left-wing titan, he pushed democratic socialism and anti-imperialism to his last breath.\n                    Quit Parliament to “spend more time on politics”—and meant it.\n                    John Major\n                    A quiet Tory PM, he steered Britain through recession and Maastricht with steady conviction.\n                    No flash, just a belief in decency and pragmatism over populism.\n                </td>\n\n                <td> <img src=\"https://flagpedia.net/data/flags/h80/gb.png\" alt=\"UK Flag\" width=\"60\"></td>\n            </tr>\n\n            <tr>\n                <td>\n                    <img src=\"images/puppy.jpg\" width=\"150px\">\n                </td>\n                <td>\n                    Donald Trump\n                    A brash outsider, he stormed U.S. politics with promises of disruption and national pride.\n                    Love him or hate him, he stuck to his script, defying elites at every turn.</td>\n                <td><img src=\"https://flagpedia.net/data/flags/h80/us.png\" alt=\"USA Flag\" width=\"60\"></td>\n            </tr>\n            <tr>\n                <td>\n                    <img src=\"images/puppy.jpg\" width=\"150px\">\n                </td>\n                <td>\n                    Betty Boothroyd\n                    The first woman Speaker of the Commons, she ruled with fairness and a steel backbone.\n                    Party didn’t matter—she upheld Parliament’s dignity above all.\n                    I’m sure there are more, but these are the ones that came to mind..</td>\n                    <td> <img src=\"https://flagpedia.net/data/flags/h80/gb.png\" alt=\"UK Flag\" width=\"60\"></td>\n            </tr>\n\n        </table>\n\n\n \n\n</div>",
    "image": "lotofmen.jpg",
    "date": "2025-04-28"
  },
  {
    "key": "1745851639336",
    "headline": "Huevos Motuleños",
    "teaser": "Only from Motul",
    "content": "<div  class=\"w3-sans-serif\" style=\"font-size:18px\">\n\n\nAny time we are passing Motul in the morning we almost always fail to pass it and instead turn off the carretera and go into the town. Motul is a fair sized small market town of 34,000 or so souls and worth a stop for its market, church, San Juan Bautist, and a small cenote on the edge of town. Apart from that though it’s the home of the famous dish eggs Motuleños, and the gold standard is to go to the food hall above the municipal market 20th November and head to concina Doña Evelia. I have no idea if the lady is still there, but the place is always packed when I go, and we have to wait 10 minutes or so for a table. I’d estimate there are maybe 200 chairs, so it must be doing good business. I don’t think there any choice other than “how many eggs?” and “how do want them cooked?”. So if you don’t like Motuleños don’t bother going.\n\nThe version there is what I would say is the basic reference. I’ve not actually watched the preparation close up, but from the taste and making them myself at home I can say it contains the following.\n\nTostadas with black beans spread on top.\nTomatoes fried with onions and garlic, plus a charred and stewed chile habanero.\nTinned processed peas,\nFried platano macho.\nFried eggs\nCilantro\nsalt.\n\nOn this basis, at home, I may add chopped ham, and grated cheese, depending how I feel.\n\nThe dish is available most restaurants in Yucatan can whip one up and it’s usually very good.\nIn Mérida I like Puruxón Cauich in Francisco Montejo.They do a few variations, but I alwasy get\nMotuleños divorciados, green and red tomatoes.\n\nThere’s also a branch in Copules but it’s not so good as the Francisco Montejo one..\n\n </div>",
    "image": "blogging.jpg",
    "date": "2025-04-28"
  }
]